Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/tc/tc_compare_mode/firmware/src/packs/ATSAMA5D29_DFP/component/smc.h
/*
 * Component description for SMC
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-10-04T10:37:14Z */
#ifndef _SAMA5D_SMC_COMPONENT_H_
#define _SAMA5D_SMC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SMC                                          */
/* ************************************************************************** */

/* -------- HSMC_CYCLE : (SMC Offset: 0x08) (R/W 32) Cycle Register -------- */
#define HSMC_CYCLE_NWE_CYCLE_Pos              _UINT32_(0)                                          /* (HSMC_CYCLE) Total Write Cycle Length Position */
#define HSMC_CYCLE_NWE_CYCLE_Msk              (_UINT32_(0x1FF) << HSMC_CYCLE_NWE_CYCLE_Pos)        /* (HSMC_CYCLE) Total Write Cycle Length Mask */
#define HSMC_CYCLE_NWE_CYCLE(value)           (HSMC_CYCLE_NWE_CYCLE_Msk & (_UINT32_(value) << HSMC_CYCLE_NWE_CYCLE_Pos)) /* Assigment of value for NWE_CYCLE in the HSMC_CYCLE register */
#define HSMC_CYCLE_NRD_CYCLE_Pos              _UINT32_(16)                                         /* (HSMC_CYCLE) Total Read Cycle Length Position */
#define HSMC_CYCLE_NRD_CYCLE_Msk              (_UINT32_(0x1FF) << HSMC_CYCLE_NRD_CYCLE_Pos)        /* (HSMC_CYCLE) Total Read Cycle Length Mask */
#define HSMC_CYCLE_NRD_CYCLE(value)           (HSMC_CYCLE_NRD_CYCLE_Msk & (_UINT32_(value) << HSMC_CYCLE_NRD_CYCLE_Pos)) /* Assigment of value for NRD_CYCLE in the HSMC_CYCLE register */
#define HSMC_CYCLE_Msk                        _UINT32_(0x01FF01FF)                                 /* (HSMC_CYCLE) Register Mask  */


/* -------- HSMC_MODE : (SMC Offset: 0x10) (R/W 32) Mode Register -------- */
#define HSMC_MODE_READ_MODE_Pos               _UINT32_(0)                                          /* (HSMC_MODE) Selection of the Control Signal for Read Operation Position */
#define HSMC_MODE_READ_MODE_Msk               (_UINT32_(0x1) << HSMC_MODE_READ_MODE_Pos)           /* (HSMC_MODE) Selection of the Control Signal for Read Operation Mask */
#define HSMC_MODE_READ_MODE(value)            (HSMC_MODE_READ_MODE_Msk & (_UINT32_(value) << HSMC_MODE_READ_MODE_Pos)) /* Assigment of value for READ_MODE in the HSMC_MODE register */
#define   HSMC_MODE_READ_MODE_NCS_CTRL_Val    _UINT32_(0x0)                                        /* (HSMC_MODE) The Read operation is controlled by the NCS signal.  */
#define   HSMC_MODE_READ_MODE_NRD_CTRL_Val    _UINT32_(0x1)                                        /* (HSMC_MODE) The Read operation is controlled by the NRD signal.  */
#define HSMC_MODE_READ_MODE_NCS_CTRL          (HSMC_MODE_READ_MODE_NCS_CTRL_Val << HSMC_MODE_READ_MODE_Pos) /* (HSMC_MODE) The Read operation is controlled by the NCS signal. Position  */
#define HSMC_MODE_READ_MODE_NRD_CTRL          (HSMC_MODE_READ_MODE_NRD_CTRL_Val << HSMC_MODE_READ_MODE_Pos) /* (HSMC_MODE) The Read operation is controlled by the NRD signal. Position  */
#define HSMC_MODE_WRITE_MODE_Pos              _UINT32_(1)                                          /* (HSMC_MODE) Selection of the Control Signal for Write Operation Position */
#define HSMC_MODE_WRITE_MODE_Msk              (_UINT32_(0x1) << HSMC_MODE_WRITE_MODE_Pos)          /* (HSMC_MODE) Selection of the Control Signal for Write Operation Mask */
#define HSMC_MODE_WRITE_MODE(value)           (HSMC_MODE_WRITE_MODE_Msk & (_UINT32_(value) << HSMC_MODE_WRITE_MODE_Pos)) /* Assigment of value for WRITE_MODE in the HSMC_MODE register */
#define   HSMC_MODE_WRITE_MODE_NCS_CTRL_Val   _UINT32_(0x0)                                        /* (HSMC_MODE) The Write operation is controller by the NCS signal.  */
#define   HSMC_MODE_WRITE_MODE_NWE_CTRL_Val   _UINT32_(0x1)                                        /* (HSMC_MODE) The Write operation is controlled by the NWE signal  */
#define HSMC_MODE_WRITE_MODE_NCS_CTRL         (HSMC_MODE_WRITE_MODE_NCS_CTRL_Val << HSMC_MODE_WRITE_MODE_Pos) /* (HSMC_MODE) The Write operation is controller by the NCS signal. Position  */
#define HSMC_MODE_WRITE_MODE_NWE_CTRL         (HSMC_MODE_WRITE_MODE_NWE_CTRL_Val << HSMC_MODE_WRITE_MODE_Pos) /* (HSMC_MODE) The Write operation is controlled by the NWE signal Position  */
#define HSMC_MODE_EXNW_MODE_Pos               _UINT32_(4)                                          /* (HSMC_MODE) NWAIT Mode Position */
#define HSMC_MODE_EXNW_MODE_Msk               (_UINT32_(0x3) << HSMC_MODE_EXNW_MODE_Pos)           /* (HSMC_MODE) NWAIT Mode Mask */
#define HSMC_MODE_EXNW_MODE(value)            (HSMC_MODE_EXNW_MODE_Msk & (_UINT32_(value) << HSMC_MODE_EXNW_MODE_Pos)) /* Assigment of value for EXNW_MODE in the HSMC_MODE register */
#define   HSMC_MODE_EXNW_MODE_DISABLED_Val    _UINT32_(0x0)                                        /* (HSMC_MODE) Disabled-The NWAIT input signal is ignored on the corresponding Chip Select.  */
#define   HSMC_MODE_EXNW_MODE_FROZEN_Val      _UINT32_(0x2)                                        /* (HSMC_MODE) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.  */
#define   HSMC_MODE_EXNW_MODE_READY_Val       _UINT32_(0x3)                                        /* (HSMC_MODE) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.  */
#define HSMC_MODE_EXNW_MODE_DISABLED          (HSMC_MODE_EXNW_MODE_DISABLED_Val << HSMC_MODE_EXNW_MODE_Pos) /* (HSMC_MODE) Disabled-The NWAIT input signal is ignored on the corresponding Chip Select. Position  */
#define HSMC_MODE_EXNW_MODE_FROZEN            (HSMC_MODE_EXNW_MODE_FROZEN_Val << HSMC_MODE_EXNW_MODE_Pos) /* (HSMC_MODE) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped. Position  */
#define HSMC_MODE_EXNW_MODE_READY             (HSMC_MODE_EXNW_MODE_READY_Val << HSMC_MODE_EXNW_MODE_Pos) /* (HSMC_MODE) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high. Position  */
#define HSMC_MODE_BAT_Pos                     _UINT32_(8)                                          /* (HSMC_MODE) Byte Access Type Position */
#define HSMC_MODE_BAT_Msk                     (_UINT32_(0x1) << HSMC_MODE_BAT_Pos)                 /* (HSMC_MODE) Byte Access Type Mask */
#define HSMC_MODE_BAT(value)                  (HSMC_MODE_BAT_Msk & (_UINT32_(value) << HSMC_MODE_BAT_Pos)) /* Assigment of value for BAT in the HSMC_MODE register */
#define   HSMC_MODE_BAT_BYTE_SELECT_Val       _UINT32_(0x0)                                        /* (HSMC_MODE) Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1.  */
#define   HSMC_MODE_BAT_BYTE_WRITE_Val        _UINT32_(0x1)                                        /* (HSMC_MODE) Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD.  */
#define HSMC_MODE_BAT_BYTE_SELECT             (HSMC_MODE_BAT_BYTE_SELECT_Val << HSMC_MODE_BAT_Pos) /* (HSMC_MODE) Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1. Position  */
#define HSMC_MODE_BAT_BYTE_WRITE              (HSMC_MODE_BAT_BYTE_WRITE_Val << HSMC_MODE_BAT_Pos)  /* (HSMC_MODE) Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD. Position  */
#define HSMC_MODE_DBW_Pos                     _UINT32_(12)                                         /* (HSMC_MODE) Data Bus Width Position */
#define HSMC_MODE_DBW_Msk                     (_UINT32_(0x1) << HSMC_MODE_DBW_Pos)                 /* (HSMC_MODE) Data Bus Width Mask */
#define HSMC_MODE_DBW(value)                  (HSMC_MODE_DBW_Msk & (_UINT32_(value) << HSMC_MODE_DBW_Pos)) /* Assigment of value for DBW in the HSMC_MODE register */
#define   HSMC_MODE_DBW_BIT_8_Val             _UINT32_(0x0)                                        /* (HSMC_MODE) 8-bit bus  */
#define   HSMC_MODE_DBW_BIT_16_Val            _UINT32_(0x1)                                        /* (HSMC_MODE) 16-bit bus  */
#define HSMC_MODE_DBW_BIT_8                   (HSMC_MODE_DBW_BIT_8_Val << HSMC_MODE_DBW_Pos)       /* (HSMC_MODE) 8-bit bus Position  */
#define HSMC_MODE_DBW_BIT_16                  (HSMC_MODE_DBW_BIT_16_Val << HSMC_MODE_DBW_Pos)      /* (HSMC_MODE) 16-bit bus Position  */
#define HSMC_MODE_TDF_CYCLES_Pos              _UINT32_(16)                                         /* (HSMC_MODE) Data Float Time Position */
#define HSMC_MODE_TDF_CYCLES_Msk              (_UINT32_(0xF) << HSMC_MODE_TDF_CYCLES_Pos)          /* (HSMC_MODE) Data Float Time Mask */
#define HSMC_MODE_TDF_CYCLES(value)           (HSMC_MODE_TDF_CYCLES_Msk & (_UINT32_(value) << HSMC_MODE_TDF_CYCLES_Pos)) /* Assigment of value for TDF_CYCLES in the HSMC_MODE register */
#define HSMC_MODE_TDF_MODE_Pos                _UINT32_(20)                                         /* (HSMC_MODE) TDF Optimization Position */
#define HSMC_MODE_TDF_MODE_Msk                (_UINT32_(0x1) << HSMC_MODE_TDF_MODE_Pos)            /* (HSMC_MODE) TDF Optimization Mask */
#define HSMC_MODE_TDF_MODE(value)             (HSMC_MODE_TDF_MODE_Msk & (_UINT32_(value) << HSMC_MODE_TDF_MODE_Pos)) /* Assigment of value for TDF_MODE in the HSMC_MODE register */
#define HSMC_MODE_Msk                         _UINT32_(0x001F1133)                                 /* (HSMC_MODE) Register Mask  */


