Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/tc/tc_compare_mode/firmware/src/packs/ATSAMA5D29_DFP/component/smc.h
/* -------- HSMC_PULSE : (SMC Offset: 0x04) (R/W 32) Pulse Register -------- */
#define HSMC_PULSE_NWE_PULSE_Pos              _UINT32_(0)                                          /* (HSMC_PULSE) NWE Pulse Length Position */
#define HSMC_PULSE_NWE_PULSE_Msk              (_UINT32_(0x7F) << HSMC_PULSE_NWE_PULSE_Pos)         /* (HSMC_PULSE) NWE Pulse Length Mask */
#define HSMC_PULSE_NWE_PULSE(value)           (HSMC_PULSE_NWE_PULSE_Msk & (_UINT32_(value) << HSMC_PULSE_NWE_PULSE_Pos)) /* Assigment of value for NWE_PULSE in the HSMC_PULSE register */
#define HSMC_PULSE_NCS_WR_PULSE_Pos           _UINT32_(8)                                          /* (HSMC_PULSE) NCS Pulse Length in WRITE Access Position */
#define HSMC_PULSE_NCS_WR_PULSE_Msk           (_UINT32_(0x7F) << HSMC_PULSE_NCS_WR_PULSE_Pos)      /* (HSMC_PULSE) NCS Pulse Length in WRITE Access Mask */
#define HSMC_PULSE_NCS_WR_PULSE(value)        (HSMC_PULSE_NCS_WR_PULSE_Msk & (_UINT32_(value) << HSMC_PULSE_NCS_WR_PULSE_Pos)) /* Assigment of value for NCS_WR_PULSE in the HSMC_PULSE register */
#define HSMC_PULSE_NRD_PULSE_Pos              _UINT32_(16)                                         /* (HSMC_PULSE) NRD Pulse Length Position */
#define HSMC_PULSE_NRD_PULSE_Msk              (_UINT32_(0x7F) << HSMC_PULSE_NRD_PULSE_Pos)         /* (HSMC_PULSE) NRD Pulse Length Mask */
#define HSMC_PULSE_NRD_PULSE(value)           (HSMC_PULSE_NRD_PULSE_Msk & (_UINT32_(value) << HSMC_PULSE_NRD_PULSE_Pos)) /* Assigment of value for NRD_PULSE in the HSMC_PULSE register */
#define HSMC_PULSE_NCS_RD_PULSE_Pos           _UINT32_(24)                                         /* (HSMC_PULSE) NCS Pulse Length in READ Access Position */
#define HSMC_PULSE_NCS_RD_PULSE_Msk           (_UINT32_(0x7F) << HSMC_PULSE_NCS_RD_PULSE_Pos)      /* (HSMC_PULSE) NCS Pulse Length in READ Access Mask */
#define HSMC_PULSE_NCS_RD_PULSE(value)        (HSMC_PULSE_NCS_RD_PULSE_Msk & (_UINT32_(value) << HSMC_PULSE_NCS_RD_PULSE_Pos)) /* Assigment of value for NCS_RD_PULSE in the HSMC_PULSE register */
#define HSMC_PULSE_Msk                        _UINT32_(0x7F7F7F7F)                                 /* (HSMC_PULSE) Register Mask  */


/* -------- HSMC_SETUP : (SMC Offset: 0x00) (R/W 32) Setup Register -------- */
#define HSMC_SETUP_NWE_SETUP_Pos              _UINT32_(0)                                          /* (HSMC_SETUP) NWE Setup Length Position */
#define HSMC_SETUP_NWE_SETUP_Msk              (_UINT32_(0x3F) << HSMC_SETUP_NWE_SETUP_Pos)         /* (HSMC_SETUP) NWE Setup Length Mask */
#define HSMC_SETUP_NWE_SETUP(value)           (HSMC_SETUP_NWE_SETUP_Msk & (_UINT32_(value) << HSMC_SETUP_NWE_SETUP_Pos)) /* Assigment of value for NWE_SETUP in the HSMC_SETUP register */
#define HSMC_SETUP_NCS_WR_SETUP_Pos           _UINT32_(8)                                          /* (HSMC_SETUP) NCS Setup Length in Write Access Position */
#define HSMC_SETUP_NCS_WR_SETUP_Msk           (_UINT32_(0x3F) << HSMC_SETUP_NCS_WR_SETUP_Pos)      /* (HSMC_SETUP) NCS Setup Length in Write Access Mask */
#define HSMC_SETUP_NCS_WR_SETUP(value)        (HSMC_SETUP_NCS_WR_SETUP_Msk & (_UINT32_(value) << HSMC_SETUP_NCS_WR_SETUP_Pos)) /* Assigment of value for NCS_WR_SETUP in the HSMC_SETUP register */
#define HSMC_SETUP_NRD_SETUP_Pos              _UINT32_(16)                                         /* (HSMC_SETUP) NRD Setup Length Position */
#define HSMC_SETUP_NRD_SETUP_Msk              (_UINT32_(0x3F) << HSMC_SETUP_NRD_SETUP_Pos)         /* (HSMC_SETUP) NRD Setup Length Mask */
#define HSMC_SETUP_NRD_SETUP(value)           (HSMC_SETUP_NRD_SETUP_Msk & (_UINT32_(value) << HSMC_SETUP_NRD_SETUP_Pos)) /* Assigment of value for NRD_SETUP in the HSMC_SETUP register */
#define HSMC_SETUP_NCS_RD_SETUP_Pos           _UINT32_(24)                                         /* (HSMC_SETUP) NCS Setup Length in Read Access Position */
#define HSMC_SETUP_NCS_RD_SETUP_Msk           (_UINT32_(0x3F) << HSMC_SETUP_NCS_RD_SETUP_Pos)      /* (HSMC_SETUP) NCS Setup Length in Read Access Mask */
#define HSMC_SETUP_NCS_RD_SETUP(value)        (HSMC_SETUP_NCS_RD_SETUP_Msk & (_UINT32_(value) << HSMC_SETUP_NCS_RD_SETUP_Pos)) /* Assigment of value for NCS_RD_SETUP in the HSMC_SETUP register */
#define HSMC_SETUP_Msk                        _UINT32_(0x3F3F3F3F)                                 /* (HSMC_SETUP) Register Mask  */


/* -------- HSMC_TIMINGS : (SMC Offset: 0x0C) (R/W 32) Timings Register -------- */
#define HSMC_TIMINGS_TCLR_Pos                 _UINT32_(0)                                          /* (HSMC_TIMINGS) CLE to REN Low Delay Position */
#define HSMC_TIMINGS_TCLR_Msk                 (_UINT32_(0xF) << HSMC_TIMINGS_TCLR_Pos)             /* (HSMC_TIMINGS) CLE to REN Low Delay Mask */
#define HSMC_TIMINGS_TCLR(value)              (HSMC_TIMINGS_TCLR_Msk & (_UINT32_(value) << HSMC_TIMINGS_TCLR_Pos)) /* Assigment of value for TCLR in the HSMC_TIMINGS register */
#define HSMC_TIMINGS_TADL_Pos                 _UINT32_(4)                                          /* (HSMC_TIMINGS) ALE to Data Start Position */
#define HSMC_TIMINGS_TADL_Msk                 (_UINT32_(0xF) << HSMC_TIMINGS_TADL_Pos)             /* (HSMC_TIMINGS) ALE to Data Start Mask */
#define HSMC_TIMINGS_TADL(value)              (HSMC_TIMINGS_TADL_Msk & (_UINT32_(value) << HSMC_TIMINGS_TADL_Pos)) /* Assigment of value for TADL in the HSMC_TIMINGS register */
#define HSMC_TIMINGS_TAR_Pos                  _UINT32_(8)                                          /* (HSMC_TIMINGS) ALE to REN Low Delay Position */
#define HSMC_TIMINGS_TAR_Msk                  (_UINT32_(0xF) << HSMC_TIMINGS_TAR_Pos)              /* (HSMC_TIMINGS) ALE to REN Low Delay Mask */
#define HSMC_TIMINGS_TAR(value)               (HSMC_TIMINGS_TAR_Msk & (_UINT32_(value) << HSMC_TIMINGS_TAR_Pos)) /* Assigment of value for TAR in the HSMC_TIMINGS register */
#define HSMC_TIMINGS_OCMS_Pos                 _UINT32_(12)                                         /* (HSMC_TIMINGS) Off Chip Memory Scrambling Enable Position */
#define HSMC_TIMINGS_OCMS_Msk                 (_UINT32_(0x1) << HSMC_TIMINGS_OCMS_Pos)             /* (HSMC_TIMINGS) Off Chip Memory Scrambling Enable Mask */
#define HSMC_TIMINGS_OCMS(value)              (HSMC_TIMINGS_OCMS_Msk & (_UINT32_(value) << HSMC_TIMINGS_OCMS_Pos)) /* Assigment of value for OCMS in the HSMC_TIMINGS register */
#define HSMC_TIMINGS_TRR_Pos                  _UINT32_(16)                                         /* (HSMC_TIMINGS) Ready to REN Low Delay Position */
#define HSMC_TIMINGS_TRR_Msk                  (_UINT32_(0xF) << HSMC_TIMINGS_TRR_Pos)              /* (HSMC_TIMINGS) Ready to REN Low Delay Mask */
#define HSMC_TIMINGS_TRR(value)               (HSMC_TIMINGS_TRR_Msk & (_UINT32_(value) << HSMC_TIMINGS_TRR_Pos)) /* Assigment of value for TRR in the HSMC_TIMINGS register */
#define HSMC_TIMINGS_TWB_Pos                  _UINT32_(24)                                         /* (HSMC_TIMINGS) WEN High to REN to Busy Position */
#define HSMC_TIMINGS_TWB_Msk                  (_UINT32_(0xF) << HSMC_TIMINGS_TWB_Pos)              /* (HSMC_TIMINGS) WEN High to REN to Busy Mask */
#define HSMC_TIMINGS_TWB(value)               (HSMC_TIMINGS_TWB_Msk & (_UINT32_(value) << HSMC_TIMINGS_TWB_Pos)) /* Assigment of value for TWB in the HSMC_TIMINGS register */
#define HSMC_TIMINGS_NFSEL_Pos                _UINT32_(31)                                         /* (HSMC_TIMINGS) NAND Flash Selection Position */
#define HSMC_TIMINGS_NFSEL_Msk                (_UINT32_(0x1) << HSMC_TIMINGS_NFSEL_Pos)            /* (HSMC_TIMINGS) NAND Flash Selection Mask */
#define HSMC_TIMINGS_NFSEL(value)             (HSMC_TIMINGS_NFSEL_Msk & (_UINT32_(value) << HSMC_TIMINGS_NFSEL_Pos)) /* Assigment of value for NFSEL in the HSMC_TIMINGS register */
#define HSMC_TIMINGS_Msk                      _UINT32_(0x8F0F1FFF)                                 /* (HSMC_TIMINGS) Register Mask  */


/* -------- HSMC_PMECC : (SMC Offset: 0x00) ( R/ 32) PMECC Redundancy 0 Register (sec_num = 0) -------- */
#define HSMC_PMECC_ECC_Pos                    _UINT32_(0)                                          /* (HSMC_PMECC) BCH Redundancy Position */
#define HSMC_PMECC_ECC_Msk                    (_UINT32_(0xFFFFFFFF) << HSMC_PMECC_ECC_Pos)         /* (HSMC_PMECC) BCH Redundancy Mask */
#define HSMC_PMECC_ECC(value)                 (HSMC_PMECC_ECC_Msk & (_UINT32_(value) << HSMC_PMECC_ECC_Pos)) /* Assigment of value for ECC in the HSMC_PMECC register */
#define HSMC_PMECC_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (HSMC_PMECC) Register Mask  */


/* -------- HSMC_REM0_ : (SMC Offset: 0x00) ( R/ 32) PMECC Remainder 0 Register (sec_num = 0) -------- */
#define HSMC_REM0__REM2NP1_Pos                _UINT32_(0)                                          /* (HSMC_REM0_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM0__REM2NP1_Msk                (_UINT32_(0x3FFF) << HSMC_REM0__REM2NP1_Pos)         /* (HSMC_REM0_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM0__REM2NP1(value)             (HSMC_REM0__REM2NP1_Msk & (_UINT32_(value) << HSMC_REM0__REM2NP1_Pos)) /* Assigment of value for REM2NP1 in the HSMC_REM0_ register */
#define HSMC_REM0__REM2NP3_Pos                _UINT32_(16)                                         /* (HSMC_REM0_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM0__REM2NP3_Msk                (_UINT32_(0x3FFF) << HSMC_REM0__REM2NP3_Pos)         /* (HSMC_REM0_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM0__REM2NP3(value)             (HSMC_REM0__REM2NP3_Msk & (_UINT32_(value) << HSMC_REM0__REM2NP3_Pos)) /* Assigment of value for REM2NP3 in the HSMC_REM0_ register */
#define HSMC_REM0__Msk                        _UINT32_(0x3FFF3FFF)                                 /* (HSMC_REM0_) Register Mask  */


