Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/tc/tc_compare_mode/firmware/src/packs/ATSAMA5D29_DFP/component/smc.h
/* -------- HSMC_REM10_ : (SMC Offset: 0x28) ( R/ 32) PMECC Remainder 10 Register (sec_num = 0) -------- */
#define HSMC_REM10__REM2NP1_Pos               _UINT32_(0)                                          /* (HSMC_REM10_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM10__REM2NP1_Msk               (_UINT32_(0x3FFF) << HSMC_REM10__REM2NP1_Pos)        /* (HSMC_REM10_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM10__REM2NP1(value)            (HSMC_REM10__REM2NP1_Msk & (_UINT32_(value) << HSMC_REM10__REM2NP1_Pos)) /* Assigment of value for REM2NP1 in the HSMC_REM10_ register */
#define HSMC_REM10__REM2NP3_Pos               _UINT32_(16)                                         /* (HSMC_REM10_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM10__REM2NP3_Msk               (_UINT32_(0x3FFF) << HSMC_REM10__REM2NP3_Pos)        /* (HSMC_REM10_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM10__REM2NP3(value)            (HSMC_REM10__REM2NP3_Msk & (_UINT32_(value) << HSMC_REM10__REM2NP3_Pos)) /* Assigment of value for REM2NP3 in the HSMC_REM10_ register */
#define HSMC_REM10__Msk                       _UINT32_(0x3FFF3FFF)                                 /* (HSMC_REM10_) Register Mask  */


/* -------- HSMC_REM11_ : (SMC Offset: 0x2C) ( R/ 32) PMECC Remainder 11 Register (sec_num = 0) -------- */
#define HSMC_REM11__REM2NP1_Pos               _UINT32_(0)                                          /* (HSMC_REM11_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM11__REM2NP1_Msk               (_UINT32_(0x3FFF) << HSMC_REM11__REM2NP1_Pos)        /* (HSMC_REM11_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM11__REM2NP1(value)            (HSMC_REM11__REM2NP1_Msk & (_UINT32_(value) << HSMC_REM11__REM2NP1_Pos)) /* Assigment of value for REM2NP1 in the HSMC_REM11_ register */
#define HSMC_REM11__REM2NP3_Pos               _UINT32_(16)                                         /* (HSMC_REM11_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM11__REM2NP3_Msk               (_UINT32_(0x3FFF) << HSMC_REM11__REM2NP3_Pos)        /* (HSMC_REM11_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM11__REM2NP3(value)            (HSMC_REM11__REM2NP3_Msk & (_UINT32_(value) << HSMC_REM11__REM2NP3_Pos)) /* Assigment of value for REM2NP3 in the HSMC_REM11_ register */
#define HSMC_REM11__Msk                       _UINT32_(0x3FFF3FFF)                                 /* (HSMC_REM11_) Register Mask  */


/* -------- HSMC_REM12_ : (SMC Offset: 0x30) ( R/ 32) PMECC Remainder 12 Register (sec_num = 0) -------- */
#define HSMC_REM12__REM2NP1_Pos               _UINT32_(0)                                          /* (HSMC_REM12_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM12__REM2NP1_Msk               (_UINT32_(0x3FFF) << HSMC_REM12__REM2NP1_Pos)        /* (HSMC_REM12_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM12__REM2NP1(value)            (HSMC_REM12__REM2NP1_Msk & (_UINT32_(value) << HSMC_REM12__REM2NP1_Pos)) /* Assigment of value for REM2NP1 in the HSMC_REM12_ register */
#define HSMC_REM12__REM2NP3_Pos               _UINT32_(16)                                         /* (HSMC_REM12_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM12__REM2NP3_Msk               (_UINT32_(0x3FFF) << HSMC_REM12__REM2NP3_Pos)        /* (HSMC_REM12_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM12__REM2NP3(value)            (HSMC_REM12__REM2NP3_Msk & (_UINT32_(value) << HSMC_REM12__REM2NP3_Pos)) /* Assigment of value for REM2NP3 in the HSMC_REM12_ register */
#define HSMC_REM12__Msk                       _UINT32_(0x3FFF3FFF)                                 /* (HSMC_REM12_) Register Mask  */


/* -------- HSMC_REM13_ : (SMC Offset: 0x34) ( R/ 32) PMECC Remainder 13 Register (sec_num = 0) -------- */
#define HSMC_REM13__REM2NP1_Pos               _UINT32_(0)                                          /* (HSMC_REM13_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM13__REM2NP1_Msk               (_UINT32_(0x3FFF) << HSMC_REM13__REM2NP1_Pos)        /* (HSMC_REM13_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM13__REM2NP1(value)            (HSMC_REM13__REM2NP1_Msk & (_UINT32_(value) << HSMC_REM13__REM2NP1_Pos)) /* Assigment of value for REM2NP1 in the HSMC_REM13_ register */
#define HSMC_REM13__REM2NP3_Pos               _UINT32_(16)                                         /* (HSMC_REM13_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM13__REM2NP3_Msk               (_UINT32_(0x3FFF) << HSMC_REM13__REM2NP3_Pos)        /* (HSMC_REM13_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM13__REM2NP3(value)            (HSMC_REM13__REM2NP3_Msk & (_UINT32_(value) << HSMC_REM13__REM2NP3_Pos)) /* Assigment of value for REM2NP3 in the HSMC_REM13_ register */
#define HSMC_REM13__Msk                       _UINT32_(0x3FFF3FFF)                                 /* (HSMC_REM13_) Register Mask  */


/* -------- HSMC_REM14_ : (SMC Offset: 0x38) ( R/ 32) PMECC Remainder 14 Register (sec_num = 0) -------- */
#define HSMC_REM14__REM2NP1_Pos               _UINT32_(0)                                          /* (HSMC_REM14_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM14__REM2NP1_Msk               (_UINT32_(0x3FFF) << HSMC_REM14__REM2NP1_Pos)        /* (HSMC_REM14_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM14__REM2NP1(value)            (HSMC_REM14__REM2NP1_Msk & (_UINT32_(value) << HSMC_REM14__REM2NP1_Pos)) /* Assigment of value for REM2NP1 in the HSMC_REM14_ register */
#define HSMC_REM14__REM2NP3_Pos               _UINT32_(16)                                         /* (HSMC_REM14_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM14__REM2NP3_Msk               (_UINT32_(0x3FFF) << HSMC_REM14__REM2NP3_Pos)        /* (HSMC_REM14_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM14__REM2NP3(value)            (HSMC_REM14__REM2NP3_Msk & (_UINT32_(value) << HSMC_REM14__REM2NP3_Pos)) /* Assigment of value for REM2NP3 in the HSMC_REM14_ register */
#define HSMC_REM14__Msk                       _UINT32_(0x3FFF3FFF)                                 /* (HSMC_REM14_) Register Mask  */


/* -------- HSMC_REM15_ : (SMC Offset: 0x3C) ( R/ 32) PMECC Remainder 15 Register (sec_num = 0) -------- */
#define HSMC_REM15__REM2NP1_Pos               _UINT32_(0)                                          /* (HSMC_REM15_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM15__REM2NP1_Msk               (_UINT32_(0x3FFF) << HSMC_REM15__REM2NP1_Pos)        /* (HSMC_REM15_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM15__REM2NP1(value)            (HSMC_REM15__REM2NP1_Msk & (_UINT32_(value) << HSMC_REM15__REM2NP1_Pos)) /* Assigment of value for REM2NP1 in the HSMC_REM15_ register */
#define HSMC_REM15__REM2NP3_Pos               _UINT32_(16)                                         /* (HSMC_REM15_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM15__REM2NP3_Msk               (_UINT32_(0x3FFF) << HSMC_REM15__REM2NP3_Pos)        /* (HSMC_REM15_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM15__REM2NP3(value)            (HSMC_REM15__REM2NP3_Msk & (_UINT32_(value) << HSMC_REM15__REM2NP3_Pos)) /* Assigment of value for REM2NP3 in the HSMC_REM15_ register */
#define HSMC_REM15__Msk                       _UINT32_(0x3FFF3FFF)                                 /* (HSMC_REM15_) Register Mask  */


