Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/tc/tc_compare_mode/firmware/src/packs/ATSAMA5D29_DFP/component/smc.h
/* -------- HSMC_REM1_ : (SMC Offset: 0x04) ( R/ 32) PMECC Remainder 1 Register (sec_num = 0) -------- */
#define HSMC_REM1__REM2NP1_Pos                _UINT32_(0)                                          /* (HSMC_REM1_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM1__REM2NP1_Msk                (_UINT32_(0x3FFF) << HSMC_REM1__REM2NP1_Pos)         /* (HSMC_REM1_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM1__REM2NP1(value)             (HSMC_REM1__REM2NP1_Msk & (_UINT32_(value) << HSMC_REM1__REM2NP1_Pos)) /* Assigment of value for REM2NP1 in the HSMC_REM1_ register */
#define HSMC_REM1__REM2NP3_Pos                _UINT32_(16)                                         /* (HSMC_REM1_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM1__REM2NP3_Msk                (_UINT32_(0x3FFF) << HSMC_REM1__REM2NP3_Pos)         /* (HSMC_REM1_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM1__REM2NP3(value)             (HSMC_REM1__REM2NP3_Msk & (_UINT32_(value) << HSMC_REM1__REM2NP3_Pos)) /* Assigment of value for REM2NP3 in the HSMC_REM1_ register */
#define HSMC_REM1__Msk                        _UINT32_(0x3FFF3FFF)                                 /* (HSMC_REM1_) Register Mask  */


/* -------- HSMC_REM2_ : (SMC Offset: 0x08) ( R/ 32) PMECC Remainder 2 Register (sec_num = 0) -------- */
#define HSMC_REM2__REM2NP1_Pos                _UINT32_(0)                                          /* (HSMC_REM2_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM2__REM2NP1_Msk                (_UINT32_(0x3FFF) << HSMC_REM2__REM2NP1_Pos)         /* (HSMC_REM2_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM2__REM2NP1(value)             (HSMC_REM2__REM2NP1_Msk & (_UINT32_(value) << HSMC_REM2__REM2NP1_Pos)) /* Assigment of value for REM2NP1 in the HSMC_REM2_ register */
#define HSMC_REM2__REM2NP3_Pos                _UINT32_(16)                                         /* (HSMC_REM2_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM2__REM2NP3_Msk                (_UINT32_(0x3FFF) << HSMC_REM2__REM2NP3_Pos)         /* (HSMC_REM2_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM2__REM2NP3(value)             (HSMC_REM2__REM2NP3_Msk & (_UINT32_(value) << HSMC_REM2__REM2NP3_Pos)) /* Assigment of value for REM2NP3 in the HSMC_REM2_ register */
#define HSMC_REM2__Msk                        _UINT32_(0x3FFF3FFF)                                 /* (HSMC_REM2_) Register Mask  */


/* -------- HSMC_REM3_ : (SMC Offset: 0x0C) ( R/ 32) PMECC Remainder 3 Register (sec_num = 0) -------- */
#define HSMC_REM3__REM2NP1_Pos                _UINT32_(0)                                          /* (HSMC_REM3_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM3__REM2NP1_Msk                (_UINT32_(0x3FFF) << HSMC_REM3__REM2NP1_Pos)         /* (HSMC_REM3_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM3__REM2NP1(value)             (HSMC_REM3__REM2NP1_Msk & (_UINT32_(value) << HSMC_REM3__REM2NP1_Pos)) /* Assigment of value for REM2NP1 in the HSMC_REM3_ register */
#define HSMC_REM3__REM2NP3_Pos                _UINT32_(16)                                         /* (HSMC_REM3_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM3__REM2NP3_Msk                (_UINT32_(0x3FFF) << HSMC_REM3__REM2NP3_Pos)         /* (HSMC_REM3_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM3__REM2NP3(value)             (HSMC_REM3__REM2NP3_Msk & (_UINT32_(value) << HSMC_REM3__REM2NP3_Pos)) /* Assigment of value for REM2NP3 in the HSMC_REM3_ register */
#define HSMC_REM3__Msk                        _UINT32_(0x3FFF3FFF)                                 /* (HSMC_REM3_) Register Mask  */


/* -------- HSMC_REM4_ : (SMC Offset: 0x10) ( R/ 32) PMECC Remainder 4 Register (sec_num = 0) -------- */
#define HSMC_REM4__REM2NP1_Pos                _UINT32_(0)                                          /* (HSMC_REM4_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM4__REM2NP1_Msk                (_UINT32_(0x3FFF) << HSMC_REM4__REM2NP1_Pos)         /* (HSMC_REM4_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM4__REM2NP1(value)             (HSMC_REM4__REM2NP1_Msk & (_UINT32_(value) << HSMC_REM4__REM2NP1_Pos)) /* Assigment of value for REM2NP1 in the HSMC_REM4_ register */
#define HSMC_REM4__REM2NP3_Pos                _UINT32_(16)                                         /* (HSMC_REM4_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM4__REM2NP3_Msk                (_UINT32_(0x3FFF) << HSMC_REM4__REM2NP3_Pos)         /* (HSMC_REM4_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM4__REM2NP3(value)             (HSMC_REM4__REM2NP3_Msk & (_UINT32_(value) << HSMC_REM4__REM2NP3_Pos)) /* Assigment of value for REM2NP3 in the HSMC_REM4_ register */
#define HSMC_REM4__Msk                        _UINT32_(0x3FFF3FFF)                                 /* (HSMC_REM4_) Register Mask  */


/* -------- HSMC_REM5_ : (SMC Offset: 0x14) ( R/ 32) PMECC Remainder 5 Register (sec_num = 0) -------- */
#define HSMC_REM5__REM2NP1_Pos                _UINT32_(0)                                          /* (HSMC_REM5_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM5__REM2NP1_Msk                (_UINT32_(0x3FFF) << HSMC_REM5__REM2NP1_Pos)         /* (HSMC_REM5_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM5__REM2NP1(value)             (HSMC_REM5__REM2NP1_Msk & (_UINT32_(value) << HSMC_REM5__REM2NP1_Pos)) /* Assigment of value for REM2NP1 in the HSMC_REM5_ register */
#define HSMC_REM5__REM2NP3_Pos                _UINT32_(16)                                         /* (HSMC_REM5_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM5__REM2NP3_Msk                (_UINT32_(0x3FFF) << HSMC_REM5__REM2NP3_Pos)         /* (HSMC_REM5_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM5__REM2NP3(value)             (HSMC_REM5__REM2NP3_Msk & (_UINT32_(value) << HSMC_REM5__REM2NP3_Pos)) /* Assigment of value for REM2NP3 in the HSMC_REM5_ register */
#define HSMC_REM5__Msk                        _UINT32_(0x3FFF3FFF)                                 /* (HSMC_REM5_) Register Mask  */


/* -------- HSMC_REM6_ : (SMC Offset: 0x18) ( R/ 32) PMECC Remainder 6 Register (sec_num = 0) -------- */
#define HSMC_REM6__REM2NP1_Pos                _UINT32_(0)                                          /* (HSMC_REM6_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM6__REM2NP1_Msk                (_UINT32_(0x3FFF) << HSMC_REM6__REM2NP1_Pos)         /* (HSMC_REM6_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM6__REM2NP1(value)             (HSMC_REM6__REM2NP1_Msk & (_UINT32_(value) << HSMC_REM6__REM2NP1_Pos)) /* Assigment of value for REM2NP1 in the HSMC_REM6_ register */
#define HSMC_REM6__REM2NP3_Pos                _UINT32_(16)                                         /* (HSMC_REM6_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM6__REM2NP3_Msk                (_UINT32_(0x3FFF) << HSMC_REM6__REM2NP3_Pos)         /* (HSMC_REM6_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM6__REM2NP3(value)             (HSMC_REM6__REM2NP3_Msk & (_UINT32_(value) << HSMC_REM6__REM2NP3_Pos)) /* Assigment of value for REM2NP3 in the HSMC_REM6_ register */
#define HSMC_REM6__Msk                        _UINT32_(0x3FFF3FFF)                                 /* (HSMC_REM6_) Register Mask  */


