Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/tc/tc_compare_mode/firmware/src/packs/ATSAMA5D29_DFP/component/smc.h
/* -------- HSMC_REM7_ : (SMC Offset: 0x1C) ( R/ 32) PMECC Remainder 7 Register (sec_num = 0) -------- */
#define HSMC_REM7__REM2NP1_Pos                _UINT32_(0)                                          /* (HSMC_REM7_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM7__REM2NP1_Msk                (_UINT32_(0x3FFF) << HSMC_REM7__REM2NP1_Pos)         /* (HSMC_REM7_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM7__REM2NP1(value)             (HSMC_REM7__REM2NP1_Msk & (_UINT32_(value) << HSMC_REM7__REM2NP1_Pos)) /* Assigment of value for REM2NP1 in the HSMC_REM7_ register */
#define HSMC_REM7__REM2NP3_Pos                _UINT32_(16)                                         /* (HSMC_REM7_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM7__REM2NP3_Msk                (_UINT32_(0x3FFF) << HSMC_REM7__REM2NP3_Pos)         /* (HSMC_REM7_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM7__REM2NP3(value)             (HSMC_REM7__REM2NP3_Msk & (_UINT32_(value) << HSMC_REM7__REM2NP3_Pos)) /* Assigment of value for REM2NP3 in the HSMC_REM7_ register */
#define HSMC_REM7__Msk                        _UINT32_(0x3FFF3FFF)                                 /* (HSMC_REM7_) Register Mask  */


/* -------- HSMC_REM8_ : (SMC Offset: 0x20) ( R/ 32) PMECC Remainder 8 Register (sec_num = 0) -------- */
#define HSMC_REM8__REM2NP1_Pos                _UINT32_(0)                                          /* (HSMC_REM8_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM8__REM2NP1_Msk                (_UINT32_(0x3FFF) << HSMC_REM8__REM2NP1_Pos)         /* (HSMC_REM8_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM8__REM2NP1(value)             (HSMC_REM8__REM2NP1_Msk & (_UINT32_(value) << HSMC_REM8__REM2NP1_Pos)) /* Assigment of value for REM2NP1 in the HSMC_REM8_ register */
#define HSMC_REM8__REM2NP3_Pos                _UINT32_(16)                                         /* (HSMC_REM8_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM8__REM2NP3_Msk                (_UINT32_(0x3FFF) << HSMC_REM8__REM2NP3_Pos)         /* (HSMC_REM8_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM8__REM2NP3(value)             (HSMC_REM8__REM2NP3_Msk & (_UINT32_(value) << HSMC_REM8__REM2NP3_Pos)) /* Assigment of value for REM2NP3 in the HSMC_REM8_ register */
#define HSMC_REM8__Msk                        _UINT32_(0x3FFF3FFF)                                 /* (HSMC_REM8_) Register Mask  */


/* -------- HSMC_REM9_ : (SMC Offset: 0x24) ( R/ 32) PMECC Remainder 9 Register (sec_num = 0) -------- */
#define HSMC_REM9__REM2NP1_Pos                _UINT32_(0)                                          /* (HSMC_REM9_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM9__REM2NP1_Msk                (_UINT32_(0x3FFF) << HSMC_REM9__REM2NP1_Pos)         /* (HSMC_REM9_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM9__REM2NP1(value)             (HSMC_REM9__REM2NP1_Msk & (_UINT32_(value) << HSMC_REM9__REM2NP1_Pos)) /* Assigment of value for REM2NP1 in the HSMC_REM9_ register */
#define HSMC_REM9__REM2NP3_Pos                _UINT32_(16)                                         /* (HSMC_REM9_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM9__REM2NP3_Msk                (_UINT32_(0x3FFF) << HSMC_REM9__REM2NP3_Pos)         /* (HSMC_REM9_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM9__REM2NP3(value)             (HSMC_REM9__REM2NP3_Msk & (_UINT32_(value) << HSMC_REM9__REM2NP3_Pos)) /* Assigment of value for REM2NP3 in the HSMC_REM9_ register */
#define HSMC_REM9__Msk                        _UINT32_(0x3FFF3FFF)                                 /* (HSMC_REM9_) Register Mask  */


/* -------- HSMC_ADDR : (SMC Offset: 0x18) (R/W 32) NFC Address Cycle Zero Register -------- */
#define HSMC_ADDR_ADDR_CYCLE0_Pos             _UINT32_(0)                                          /* (HSMC_ADDR) NAND Flash Array Address Cycle 0 Position */
#define HSMC_ADDR_ADDR_CYCLE0_Msk             (_UINT32_(0xFF) << HSMC_ADDR_ADDR_CYCLE0_Pos)        /* (HSMC_ADDR) NAND Flash Array Address Cycle 0 Mask */
#define HSMC_ADDR_ADDR_CYCLE0(value)          (HSMC_ADDR_ADDR_CYCLE0_Msk & (_UINT32_(value) << HSMC_ADDR_ADDR_CYCLE0_Pos)) /* Assigment of value for ADDR_CYCLE0 in the HSMC_ADDR register */
#define HSMC_ADDR_Msk                         _UINT32_(0x000000FF)                                 /* (HSMC_ADDR) Register Mask  */


/* -------- HSMC_BANK : (SMC Offset: 0x1C) (R/W 32) Bank Address Register -------- */
#define HSMC_BANK_BANK_Pos                    _UINT32_(0)                                          /* (HSMC_BANK) Bank Identifier Position */
#define HSMC_BANK_BANK_Msk                    (_UINT32_(0x1) << HSMC_BANK_BANK_Pos)                /* (HSMC_BANK) Bank Identifier Mask */
#define HSMC_BANK_BANK(value)                 (HSMC_BANK_BANK_Msk & (_UINT32_(value) << HSMC_BANK_BANK_Pos)) /* Assigment of value for BANK in the HSMC_BANK register */
#define HSMC_BANK_Msk                         _UINT32_(0x00000001)                                 /* (HSMC_BANK) Register Mask  */


/* -------- HSMC_CFG : (SMC Offset: 0x00) (R/W 32) NFC Configuration Register -------- */
#define HSMC_CFG_PAGESIZE_Pos                 _UINT32_(0)                                          /* (HSMC_CFG) Page Size of the NAND Flash Device Position */
#define HSMC_CFG_PAGESIZE_Msk                 (_UINT32_(0x7) << HSMC_CFG_PAGESIZE_Pos)             /* (HSMC_CFG) Page Size of the NAND Flash Device Mask */
#define HSMC_CFG_PAGESIZE(value)              (HSMC_CFG_PAGESIZE_Msk & (_UINT32_(value) << HSMC_CFG_PAGESIZE_Pos)) /* Assigment of value for PAGESIZE in the HSMC_CFG register */
#define   HSMC_CFG_PAGESIZE_PS512_Val         _UINT32_(0x0)                                        /* (HSMC_CFG) Main area 512 bytes  */
#define   HSMC_CFG_PAGESIZE_PS1024_Val        _UINT32_(0x1)                                        /* (HSMC_CFG) Main area 1024 bytes  */
#define   HSMC_CFG_PAGESIZE_PS2048_Val        _UINT32_(0x2)                                        /* (HSMC_CFG) Main area 2048 bytes  */
#define   HSMC_CFG_PAGESIZE_PS4096_Val        _UINT32_(0x3)                                        /* (HSMC_CFG) Main area 4096 bytes  */
#define   HSMC_CFG_PAGESIZE_PS8192_Val        _UINT32_(0x4)                                        /* (HSMC_CFG) Main area 8192 bytes  */
#define HSMC_CFG_PAGESIZE_PS512               (HSMC_CFG_PAGESIZE_PS512_Val << HSMC_CFG_PAGESIZE_Pos) /* (HSMC_CFG) Main area 512 bytes Position  */
#define HSMC_CFG_PAGESIZE_PS1024              (HSMC_CFG_PAGESIZE_PS1024_Val << HSMC_CFG_PAGESIZE_Pos) /* (HSMC_CFG) Main area 1024 bytes Position  */
#define HSMC_CFG_PAGESIZE_PS2048              (HSMC_CFG_PAGESIZE_PS2048_Val << HSMC_CFG_PAGESIZE_Pos) /* (HSMC_CFG) Main area 2048 bytes Position  */
#define HSMC_CFG_PAGESIZE_PS4096              (HSMC_CFG_PAGESIZE_PS4096_Val << HSMC_CFG_PAGESIZE_Pos) /* (HSMC_CFG) Main area 4096 bytes Position  */
#define HSMC_CFG_PAGESIZE_PS8192              (HSMC_CFG_PAGESIZE_PS8192_Val << HSMC_CFG_PAGESIZE_Pos) /* (HSMC_CFG) Main area 8192 bytes Position  */
#define HSMC_CFG_WSPARE_Pos                   _UINT32_(8)                                          /* (HSMC_CFG) Write Spare Area Position */
#define HSMC_CFG_WSPARE_Msk                   (_UINT32_(0x1) << HSMC_CFG_WSPARE_Pos)               /* (HSMC_CFG) Write Spare Area Mask */
#define HSMC_CFG_WSPARE(value)                (HSMC_CFG_WSPARE_Msk & (_UINT32_(value) << HSMC_CFG_WSPARE_Pos)) /* Assigment of value for WSPARE in the HSMC_CFG register */
#define HSMC_CFG_RSPARE_Pos                   _UINT32_(9)                                          /* (HSMC_CFG) Read Spare Area Position */
#define HSMC_CFG_RSPARE_Msk                   (_UINT32_(0x1) << HSMC_CFG_RSPARE_Pos)               /* (HSMC_CFG) Read Spare Area Mask */
#define HSMC_CFG_RSPARE(value)                (HSMC_CFG_RSPARE_Msk & (_UINT32_(value) << HSMC_CFG_RSPARE_Pos)) /* Assigment of value for RSPARE in the HSMC_CFG register */
#define HSMC_CFG_EDGECTRL_Pos                 _UINT32_(12)                                         /* (HSMC_CFG) Rising/Falling Edge Detection Control Position */
#define HSMC_CFG_EDGECTRL_Msk                 (_UINT32_(0x1) << HSMC_CFG_EDGECTRL_Pos)             /* (HSMC_CFG) Rising/Falling Edge Detection Control Mask */
#define HSMC_CFG_EDGECTRL(value)              (HSMC_CFG_EDGECTRL_Msk & (_UINT32_(value) << HSMC_CFG_EDGECTRL_Pos)) /* Assigment of value for EDGECTRL in the HSMC_CFG register */
#define HSMC_CFG_RBEDGE_Pos                   _UINT32_(13)                                         /* (HSMC_CFG) Ready/Busy Signal Edge Detection Position */
#define HSMC_CFG_RBEDGE_Msk                   (_UINT32_(0x1) << HSMC_CFG_RBEDGE_Pos)               /* (HSMC_CFG) Ready/Busy Signal Edge Detection Mask */
#define HSMC_CFG_RBEDGE(value)                (HSMC_CFG_RBEDGE_Msk & (_UINT32_(value) << HSMC_CFG_RBEDGE_Pos)) /* Assigment of value for RBEDGE in the HSMC_CFG register */
#define HSMC_CFG_DTOCYC_Pos                   _UINT32_(16)                                         /* (HSMC_CFG) Data Timeout Cycle Number Position */
#define HSMC_CFG_DTOCYC_Msk                   (_UINT32_(0xF) << HSMC_CFG_DTOCYC_Pos)               /* (HSMC_CFG) Data Timeout Cycle Number Mask */
#define HSMC_CFG_DTOCYC(value)                (HSMC_CFG_DTOCYC_Msk & (_UINT32_(value) << HSMC_CFG_DTOCYC_Pos)) /* Assigment of value for DTOCYC in the HSMC_CFG register */
#define HSMC_CFG_DTOMUL_Pos                   _UINT32_(20)                                         /* (HSMC_CFG) Data Timeout Multiplier Position */
#define HSMC_CFG_DTOMUL_Msk                   (_UINT32_(0x7) << HSMC_CFG_DTOMUL_Pos)               /* (HSMC_CFG) Data Timeout Multiplier Mask */
#define HSMC_CFG_DTOMUL(value)                (HSMC_CFG_DTOMUL_Msk & (_UINT32_(value) << HSMC_CFG_DTOMUL_Pos)) /* Assigment of value for DTOMUL in the HSMC_CFG register */
#define   HSMC_CFG_DTOMUL_X1_Val              _UINT32_(0x0)                                        /* (HSMC_CFG) DTOCYC  */
#define   HSMC_CFG_DTOMUL_X16_Val             _UINT32_(0x1)                                        /* (HSMC_CFG) DTOCYC x 16  */
#define   HSMC_CFG_DTOMUL_X128_Val            _UINT32_(0x2)                                        /* (HSMC_CFG) DTOCYC x 128  */
#define   HSMC_CFG_DTOMUL_X256_Val            _UINT32_(0x3)                                        /* (HSMC_CFG) DTOCYC x 256  */
#define   HSMC_CFG_DTOMUL_X1024_Val           _UINT32_(0x4)                                        /* (HSMC_CFG) DTOCYC x 1024  */
#define   HSMC_CFG_DTOMUL_X4096_Val           _UINT32_(0x5)                                        /* (HSMC_CFG) DTOCYC x 4096  */
#define   HSMC_CFG_DTOMUL_X65536_Val          _UINT32_(0x6)                                        /* (HSMC_CFG) DTOCYC x 65536  */
#define   HSMC_CFG_DTOMUL_X1048576_Val        _UINT32_(0x7)                                        /* (HSMC_CFG) DTOCYC x 1048576  */
#define HSMC_CFG_DTOMUL_X1                    (HSMC_CFG_DTOMUL_X1_Val << HSMC_CFG_DTOMUL_Pos)      /* (HSMC_CFG) DTOCYC Position  */
#define HSMC_CFG_DTOMUL_X16                   (HSMC_CFG_DTOMUL_X16_Val << HSMC_CFG_DTOMUL_Pos)     /* (HSMC_CFG) DTOCYC x 16 Position  */
#define HSMC_CFG_DTOMUL_X128                  (HSMC_CFG_DTOMUL_X128_Val << HSMC_CFG_DTOMUL_Pos)    /* (HSMC_CFG) DTOCYC x 128 Position  */
#define HSMC_CFG_DTOMUL_X256                  (HSMC_CFG_DTOMUL_X256_Val << HSMC_CFG_DTOMUL_Pos)    /* (HSMC_CFG) DTOCYC x 256 Position  */
#define HSMC_CFG_DTOMUL_X1024                 (HSMC_CFG_DTOMUL_X1024_Val << HSMC_CFG_DTOMUL_Pos)   /* (HSMC_CFG) DTOCYC x 1024 Position  */
#define HSMC_CFG_DTOMUL_X4096                 (HSMC_CFG_DTOMUL_X4096_Val << HSMC_CFG_DTOMUL_Pos)   /* (HSMC_CFG) DTOCYC x 4096 Position  */
#define HSMC_CFG_DTOMUL_X65536                (HSMC_CFG_DTOMUL_X65536_Val << HSMC_CFG_DTOMUL_Pos)  /* (HSMC_CFG) DTOCYC x 65536 Position  */
#define HSMC_CFG_DTOMUL_X1048576              (HSMC_CFG_DTOMUL_X1048576_Val << HSMC_CFG_DTOMUL_Pos) /* (HSMC_CFG) DTOCYC x 1048576 Position  */
#define HSMC_CFG_NFCSPARESIZE_Pos             _UINT32_(24)                                         /* (HSMC_CFG) NAND Flash Spare Area Size Retrieved by the Host Controller Position */
#define HSMC_CFG_NFCSPARESIZE_Msk             (_UINT32_(0x7F) << HSMC_CFG_NFCSPARESIZE_Pos)        /* (HSMC_CFG) NAND Flash Spare Area Size Retrieved by the Host Controller Mask */
#define HSMC_CFG_NFCSPARESIZE(value)          (HSMC_CFG_NFCSPARESIZE_Msk & (_UINT32_(value) << HSMC_CFG_NFCSPARESIZE_Pos)) /* Assigment of value for NFCSPARESIZE in the HSMC_CFG register */
#define HSMC_CFG_Msk                          _UINT32_(0x7F7F3307)                                 /* (HSMC_CFG) Register Mask  */


/* -------- HSMC_CTRL : (SMC Offset: 0x04) ( /W 32) NFC Control Register -------- */
#define HSMC_CTRL_NFCEN_Pos                   _UINT32_(0)                                          /* (HSMC_CTRL) NAND Flash Controller Enable Position */
#define HSMC_CTRL_NFCEN_Msk                   (_UINT32_(0x1) << HSMC_CTRL_NFCEN_Pos)               /* (HSMC_CTRL) NAND Flash Controller Enable Mask */
#define HSMC_CTRL_NFCEN(value)                (HSMC_CTRL_NFCEN_Msk & (_UINT32_(value) << HSMC_CTRL_NFCEN_Pos)) /* Assigment of value for NFCEN in the HSMC_CTRL register */
#define HSMC_CTRL_NFCDIS_Pos                  _UINT32_(1)                                          /* (HSMC_CTRL) NAND Flash Controller Disable Position */
#define HSMC_CTRL_NFCDIS_Msk                  (_UINT32_(0x1) << HSMC_CTRL_NFCDIS_Pos)              /* (HSMC_CTRL) NAND Flash Controller Disable Mask */
#define HSMC_CTRL_NFCDIS(value)               (HSMC_CTRL_NFCDIS_Msk & (_UINT32_(value) << HSMC_CTRL_NFCDIS_Pos)) /* Assigment of value for NFCDIS in the HSMC_CTRL register */
#define HSMC_CTRL_Msk                         _UINT32_(0x00000003)                                 /* (HSMC_CTRL) Register Mask  */


/* -------- HSMC_ELCFG : (SMC Offset: 0x500) (R/W 32) PMECC Error Location Configuration Register -------- */
#define HSMC_ELCFG_SECTORSZ_Pos               _UINT32_(0)                                          /* (HSMC_ELCFG) Sector Size Position */
#define HSMC_ELCFG_SECTORSZ_Msk               (_UINT32_(0x1) << HSMC_ELCFG_SECTORSZ_Pos)           /* (HSMC_ELCFG) Sector Size Mask */
#define HSMC_ELCFG_SECTORSZ(value)            (HSMC_ELCFG_SECTORSZ_Msk & (_UINT32_(value) << HSMC_ELCFG_SECTORSZ_Pos)) /* Assigment of value for SECTORSZ in the HSMC_ELCFG register */
#define   HSMC_ELCFG_SECTORSZ_SECTORSZ0_Val   _UINT32_(0x0)                                        /* (HSMC_ELCFG) Use  512 Byte Sector in Location Computation  */
#define   HSMC_ELCFG_SECTORSZ_SECTORSZ1_Val   _UINT32_(0x1)                                        /* (HSMC_ELCFG) Use 1024 Byte Sector in Location Computation  */
#define HSMC_ELCFG_SECTORSZ_SECTORSZ0         (HSMC_ELCFG_SECTORSZ_SECTORSZ0_Val << HSMC_ELCFG_SECTORSZ_Pos) /* (HSMC_ELCFG) Use  512 Byte Sector in Location Computation Position  */
#define HSMC_ELCFG_SECTORSZ_SECTORSZ1         (HSMC_ELCFG_SECTORSZ_SECTORSZ1_Val << HSMC_ELCFG_SECTORSZ_Pos) /* (HSMC_ELCFG) Use 1024 Byte Sector in Location Computation Position  */
#define HSMC_ELCFG_ERRNUM_Pos                 _UINT32_(16)                                         /* (HSMC_ELCFG) Number of Errors Position */
#define HSMC_ELCFG_ERRNUM_Msk                 (_UINT32_(0x1F) << HSMC_ELCFG_ERRNUM_Pos)            /* (HSMC_ELCFG) Number of Errors Mask */
#define HSMC_ELCFG_ERRNUM(value)              (HSMC_ELCFG_ERRNUM_Msk & (_UINT32_(value) << HSMC_ELCFG_ERRNUM_Pos)) /* Assigment of value for ERRNUM in the HSMC_ELCFG register */
#define HSMC_ELCFG_Msk                        _UINT32_(0x001F0001)                                 /* (HSMC_ELCFG) Register Mask  */


/* -------- HSMC_ELDIS : (SMC Offset: 0x50C) ( /W 32) PMECC Error Location Disable Register -------- */
#define HSMC_ELDIS_DIS_Pos                    _UINT32_(0)                                          /* (HSMC_ELDIS) Disable Error Location Engine Position */
#define HSMC_ELDIS_DIS_Msk                    (_UINT32_(0x1) << HSMC_ELDIS_DIS_Pos)                /* (HSMC_ELDIS) Disable Error Location Engine Mask */
#define HSMC_ELDIS_DIS(value)                 (HSMC_ELDIS_DIS_Msk & (_UINT32_(value) << HSMC_ELDIS_DIS_Pos)) /* Assigment of value for DIS in the HSMC_ELDIS register */
#define HSMC_ELDIS_Msk                        _UINT32_(0x00000001)                                 /* (HSMC_ELDIS) Register Mask  */


/* -------- HSMC_ELEN : (SMC Offset: 0x508) ( /W 32) PMECC Error Location Enable Register -------- */
#define HSMC_ELEN_ENINIT_Pos                  _UINT32_(0)                                          /* (HSMC_ELEN) Error Location Enable Position */
#define HSMC_ELEN_ENINIT_Msk                  (_UINT32_(0x3FFF) << HSMC_ELEN_ENINIT_Pos)           /* (HSMC_ELEN) Error Location Enable Mask */
#define HSMC_ELEN_ENINIT(value)               (HSMC_ELEN_ENINIT_Msk & (_UINT32_(value) << HSMC_ELEN_ENINIT_Pos)) /* Assigment of value for ENINIT in the HSMC_ELEN register */
#define HSMC_ELEN_Msk                         _UINT32_(0x00003FFF)                                 /* (HSMC_ELEN) Register Mask  */


/* -------- HSMC_ELIDR : (SMC Offset: 0x518) ( /W 32) PMECC Error Location Interrupt Disable Register -------- */
#define HSMC_ELIDR_DONE_Pos                   _UINT32_(0)                                          /* (HSMC_ELIDR) Computation Terminated Interrupt Disable Position */
#define HSMC_ELIDR_DONE_Msk                   (_UINT32_(0x1) << HSMC_ELIDR_DONE_Pos)               /* (HSMC_ELIDR) Computation Terminated Interrupt Disable Mask */
#define HSMC_ELIDR_DONE(value)                (HSMC_ELIDR_DONE_Msk & (_UINT32_(value) << HSMC_ELIDR_DONE_Pos)) /* Assigment of value for DONE in the HSMC_ELIDR register */
#define HSMC_ELIDR_Msk                        _UINT32_(0x00000001)                                 /* (HSMC_ELIDR) Register Mask  */


