Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/tc/tc_compare_mode/firmware/src/packs/ATSAMA5D29_DFP/component/smc.h
/* -------- HSMC_ELIER : (SMC Offset: 0x514) ( /W 32) PMECC Error Location Interrupt Enable register -------- */
#define HSMC_ELIER_DONE_Pos                   _UINT32_(0)                                          /* (HSMC_ELIER) Computation Terminated Interrupt Enable Position */
#define HSMC_ELIER_DONE_Msk                   (_UINT32_(0x1) << HSMC_ELIER_DONE_Pos)               /* (HSMC_ELIER) Computation Terminated Interrupt Enable Mask */
#define HSMC_ELIER_DONE(value)                (HSMC_ELIER_DONE_Msk & (_UINT32_(value) << HSMC_ELIER_DONE_Pos)) /* Assigment of value for DONE in the HSMC_ELIER register */
#define HSMC_ELIER_Msk                        _UINT32_(0x00000001)                                 /* (HSMC_ELIER) Register Mask  */


/* -------- HSMC_ELIMR : (SMC Offset: 0x51C) ( R/ 32) PMECC Error Location Interrupt Mask Register -------- */
#define HSMC_ELIMR_DONE_Pos                   _UINT32_(0)                                          /* (HSMC_ELIMR) Computation Terminated Interrupt Mask Position */
#define HSMC_ELIMR_DONE_Msk                   (_UINT32_(0x1) << HSMC_ELIMR_DONE_Pos)               /* (HSMC_ELIMR) Computation Terminated Interrupt Mask Mask */
#define HSMC_ELIMR_DONE(value)                (HSMC_ELIMR_DONE_Msk & (_UINT32_(value) << HSMC_ELIMR_DONE_Pos)) /* Assigment of value for DONE in the HSMC_ELIMR register */
#define HSMC_ELIMR_Msk                        _UINT32_(0x00000001)                                 /* (HSMC_ELIMR) Register Mask  */


/* -------- HSMC_ELISR : (SMC Offset: 0x520) ( R/ 32) PMECC Error Location Interrupt Status Register -------- */
#define HSMC_ELISR_DONE_Pos                   _UINT32_(0)                                          /* (HSMC_ELISR) Computation Terminated Interrupt Status Position */
#define HSMC_ELISR_DONE_Msk                   (_UINT32_(0x1) << HSMC_ELISR_DONE_Pos)               /* (HSMC_ELISR) Computation Terminated Interrupt Status Mask */
#define HSMC_ELISR_DONE(value)                (HSMC_ELISR_DONE_Msk & (_UINT32_(value) << HSMC_ELISR_DONE_Pos)) /* Assigment of value for DONE in the HSMC_ELISR register */
#define HSMC_ELISR_ERR_CNT_Pos                _UINT32_(8)                                          /* (HSMC_ELISR) Error Counter value Position */
#define HSMC_ELISR_ERR_CNT_Msk                (_UINT32_(0x3F) << HSMC_ELISR_ERR_CNT_Pos)           /* (HSMC_ELISR) Error Counter value Mask */
#define HSMC_ELISR_ERR_CNT(value)             (HSMC_ELISR_ERR_CNT_Msk & (_UINT32_(value) << HSMC_ELISR_ERR_CNT_Pos)) /* Assigment of value for ERR_CNT in the HSMC_ELISR register */
#define HSMC_ELISR_Msk                        _UINT32_(0x00003F01)                                 /* (HSMC_ELISR) Register Mask  */


/* -------- HSMC_ELPRIM : (SMC Offset: 0x504) ( R/ 32) PMECC Error Location Primitive Register -------- */
#define HSMC_ELPRIM_PRIMITIV_Pos              _UINT32_(0)                                          /* (HSMC_ELPRIM) Primitive Polynomial Position */
#define HSMC_ELPRIM_PRIMITIV_Msk              (_UINT32_(0xFFFF) << HSMC_ELPRIM_PRIMITIV_Pos)       /* (HSMC_ELPRIM) Primitive Polynomial Mask */
#define HSMC_ELPRIM_PRIMITIV(value)           (HSMC_ELPRIM_PRIMITIV_Msk & (_UINT32_(value) << HSMC_ELPRIM_PRIMITIV_Pos)) /* Assigment of value for PRIMITIV in the HSMC_ELPRIM register */
#define HSMC_ELPRIM_Msk                       _UINT32_(0x0000FFFF)                                 /* (HSMC_ELPRIM) Register Mask  */


/* -------- HSMC_ELSR : (SMC Offset: 0x510) ( R/ 32) PMECC Error Location Status Register -------- */
#define HSMC_ELSR_BUSY_Pos                    _UINT32_(0)                                          /* (HSMC_ELSR) Error Location Engine Busy Position */
#define HSMC_ELSR_BUSY_Msk                    (_UINT32_(0x1) << HSMC_ELSR_BUSY_Pos)                /* (HSMC_ELSR) Error Location Engine Busy Mask */
#define HSMC_ELSR_BUSY(value)                 (HSMC_ELSR_BUSY_Msk & (_UINT32_(value) << HSMC_ELSR_BUSY_Pos)) /* Assigment of value for BUSY in the HSMC_ELSR register */
#define HSMC_ELSR_Msk                         _UINT32_(0x00000001)                                 /* (HSMC_ELSR) Register Mask  */


/* -------- HSMC_ERRLOC : (SMC Offset: 0x5AC) ( R/ 32) PMECC Error Location 0 Register -------- */
#define HSMC_ERRLOC_ERRLOCN_Pos               _UINT32_(0)                                          /* (HSMC_ERRLOC) Error Position within the Set {sector area, spare area} Position */
#define HSMC_ERRLOC_ERRLOCN_Msk               (_UINT32_(0x3FFF) << HSMC_ERRLOC_ERRLOCN_Pos)        /* (HSMC_ERRLOC) Error Position within the Set {sector area, spare area} Mask */
#define HSMC_ERRLOC_ERRLOCN(value)            (HSMC_ERRLOC_ERRLOCN_Msk & (_UINT32_(value) << HSMC_ERRLOC_ERRLOCN_Pos)) /* Assigment of value for ERRLOCN in the HSMC_ERRLOC register */
#define HSMC_ERRLOC_Msk                       _UINT32_(0x00003FFF)                                 /* (HSMC_ERRLOC) Register Mask  */


/* -------- HSMC_IDR : (SMC Offset: 0x10) ( /W 32) NFC Interrupt Disable Register -------- */
#define HSMC_IDR_RB_RISE_Pos                  _UINT32_(4)                                          /* (HSMC_IDR) Ready Busy Rising Edge Detection Interrupt Disable Position */
#define HSMC_IDR_RB_RISE_Msk                  (_UINT32_(0x1) << HSMC_IDR_RB_RISE_Pos)              /* (HSMC_IDR) Ready Busy Rising Edge Detection Interrupt Disable Mask */
#define HSMC_IDR_RB_RISE(value)               (HSMC_IDR_RB_RISE_Msk & (_UINT32_(value) << HSMC_IDR_RB_RISE_Pos)) /* Assigment of value for RB_RISE in the HSMC_IDR register */
#define HSMC_IDR_RB_FALL_Pos                  _UINT32_(5)                                          /* (HSMC_IDR) Ready Busy Falling Edge Detection Interrupt Disable Position */
#define HSMC_IDR_RB_FALL_Msk                  (_UINT32_(0x1) << HSMC_IDR_RB_FALL_Pos)              /* (HSMC_IDR) Ready Busy Falling Edge Detection Interrupt Disable Mask */
#define HSMC_IDR_RB_FALL(value)               (HSMC_IDR_RB_FALL_Msk & (_UINT32_(value) << HSMC_IDR_RB_FALL_Pos)) /* Assigment of value for RB_FALL in the HSMC_IDR register */
#define HSMC_IDR_XFRDONE_Pos                  _UINT32_(16)                                         /* (HSMC_IDR) Transfer Done Interrupt Disable Position */
#define HSMC_IDR_XFRDONE_Msk                  (_UINT32_(0x1) << HSMC_IDR_XFRDONE_Pos)              /* (HSMC_IDR) Transfer Done Interrupt Disable Mask */
#define HSMC_IDR_XFRDONE(value)               (HSMC_IDR_XFRDONE_Msk & (_UINT32_(value) << HSMC_IDR_XFRDONE_Pos)) /* Assigment of value for XFRDONE in the HSMC_IDR register */
#define HSMC_IDR_CMDDONE_Pos                  _UINT32_(17)                                         /* (HSMC_IDR) Command Done Interrupt Disable Position */
#define HSMC_IDR_CMDDONE_Msk                  (_UINT32_(0x1) << HSMC_IDR_CMDDONE_Pos)              /* (HSMC_IDR) Command Done Interrupt Disable Mask */
#define HSMC_IDR_CMDDONE(value)               (HSMC_IDR_CMDDONE_Msk & (_UINT32_(value) << HSMC_IDR_CMDDONE_Pos)) /* Assigment of value for CMDDONE in the HSMC_IDR register */
#define HSMC_IDR_DTOE_Pos                     _UINT32_(20)                                         /* (HSMC_IDR) Data Timeout Error Interrupt Disable Position */
#define HSMC_IDR_DTOE_Msk                     (_UINT32_(0x1) << HSMC_IDR_DTOE_Pos)                 /* (HSMC_IDR) Data Timeout Error Interrupt Disable Mask */
#define HSMC_IDR_DTOE(value)                  (HSMC_IDR_DTOE_Msk & (_UINT32_(value) << HSMC_IDR_DTOE_Pos)) /* Assigment of value for DTOE in the HSMC_IDR register */
#define HSMC_IDR_UNDEF_Pos                    _UINT32_(21)                                         /* (HSMC_IDR) Undefined Area Access Interrupt Disable Position */
#define HSMC_IDR_UNDEF_Msk                    (_UINT32_(0x1) << HSMC_IDR_UNDEF_Pos)                /* (HSMC_IDR) Undefined Area Access Interrupt Disable Mask */
#define HSMC_IDR_UNDEF(value)                 (HSMC_IDR_UNDEF_Msk & (_UINT32_(value) << HSMC_IDR_UNDEF_Pos)) /* Assigment of value for UNDEF in the HSMC_IDR register */
#define HSMC_IDR_AWB_Pos                      _UINT32_(22)                                         /* (HSMC_IDR) Accessing While Busy Interrupt Disable Position */
#define HSMC_IDR_AWB_Msk                      (_UINT32_(0x1) << HSMC_IDR_AWB_Pos)                  /* (HSMC_IDR) Accessing While Busy Interrupt Disable Mask */
#define HSMC_IDR_AWB(value)                   (HSMC_IDR_AWB_Msk & (_UINT32_(value) << HSMC_IDR_AWB_Pos)) /* Assigment of value for AWB in the HSMC_IDR register */
#define HSMC_IDR_NFCASE_Pos                   _UINT32_(23)                                         /* (HSMC_IDR) NFC Access Size Error Interrupt Disable Position */
#define HSMC_IDR_NFCASE_Msk                   (_UINT32_(0x1) << HSMC_IDR_NFCASE_Pos)               /* (HSMC_IDR) NFC Access Size Error Interrupt Disable Mask */
#define HSMC_IDR_NFCASE(value)                (HSMC_IDR_NFCASE_Msk & (_UINT32_(value) << HSMC_IDR_NFCASE_Pos)) /* Assigment of value for NFCASE in the HSMC_IDR register */
#define HSMC_IDR_RB_EDGE0_Pos                 _UINT32_(24)                                         /* (HSMC_IDR) Ready/Busy Line 0 Interrupt Disable Position */
#define HSMC_IDR_RB_EDGE0_Msk                 (_UINT32_(0x1) << HSMC_IDR_RB_EDGE0_Pos)             /* (HSMC_IDR) Ready/Busy Line 0 Interrupt Disable Mask */
#define HSMC_IDR_RB_EDGE0(value)              (HSMC_IDR_RB_EDGE0_Msk & (_UINT32_(value) << HSMC_IDR_RB_EDGE0_Pos)) /* Assigment of value for RB_EDGE0 in the HSMC_IDR register */
#define HSMC_IDR_Msk                          _UINT32_(0x01F30030)                                 /* (HSMC_IDR) Register Mask  */

