Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/tc/tc_compare_mode/firmware/src/packs/ATSAMA5D29_DFP/component/smc.h
#define HSMC_IDR_RB_EDGE_Pos                  _UINT32_(24)                                         /* (HSMC_IDR Position) Ready/Busy Line x Interrupt Disable */
#define HSMC_IDR_RB_EDGE_Msk                  (_UINT32_(0x1) << HSMC_IDR_RB_EDGE_Pos)              /* (HSMC_IDR Mask) RB_EDGE */
#define HSMC_IDR_RB_EDGE(value)               (HSMC_IDR_RB_EDGE_Msk & (_UINT32_(value) << HSMC_IDR_RB_EDGE_Pos)) 

/* -------- HSMC_IER : (SMC Offset: 0x0C) ( /W 32) NFC Interrupt Enable Register -------- */
#define HSMC_IER_RB_RISE_Pos                  _UINT32_(4)                                          /* (HSMC_IER) Ready Busy Rising Edge Detection Interrupt Enable Position */
#define HSMC_IER_RB_RISE_Msk                  (_UINT32_(0x1) << HSMC_IER_RB_RISE_Pos)              /* (HSMC_IER) Ready Busy Rising Edge Detection Interrupt Enable Mask */
#define HSMC_IER_RB_RISE(value)               (HSMC_IER_RB_RISE_Msk & (_UINT32_(value) << HSMC_IER_RB_RISE_Pos)) /* Assigment of value for RB_RISE in the HSMC_IER register */
#define HSMC_IER_RB_FALL_Pos                  _UINT32_(5)                                          /* (HSMC_IER) Ready Busy Falling Edge Detection Interrupt Enable Position */
#define HSMC_IER_RB_FALL_Msk                  (_UINT32_(0x1) << HSMC_IER_RB_FALL_Pos)              /* (HSMC_IER) Ready Busy Falling Edge Detection Interrupt Enable Mask */
#define HSMC_IER_RB_FALL(value)               (HSMC_IER_RB_FALL_Msk & (_UINT32_(value) << HSMC_IER_RB_FALL_Pos)) /* Assigment of value for RB_FALL in the HSMC_IER register */
#define HSMC_IER_XFRDONE_Pos                  _UINT32_(16)                                         /* (HSMC_IER) Transfer Done Interrupt Enable Position */
#define HSMC_IER_XFRDONE_Msk                  (_UINT32_(0x1) << HSMC_IER_XFRDONE_Pos)              /* (HSMC_IER) Transfer Done Interrupt Enable Mask */
#define HSMC_IER_XFRDONE(value)               (HSMC_IER_XFRDONE_Msk & (_UINT32_(value) << HSMC_IER_XFRDONE_Pos)) /* Assigment of value for XFRDONE in the HSMC_IER register */
#define HSMC_IER_CMDDONE_Pos                  _UINT32_(17)                                         /* (HSMC_IER) Command Done Interrupt Enable Position */
#define HSMC_IER_CMDDONE_Msk                  (_UINT32_(0x1) << HSMC_IER_CMDDONE_Pos)              /* (HSMC_IER) Command Done Interrupt Enable Mask */
#define HSMC_IER_CMDDONE(value)               (HSMC_IER_CMDDONE_Msk & (_UINT32_(value) << HSMC_IER_CMDDONE_Pos)) /* Assigment of value for CMDDONE in the HSMC_IER register */
#define HSMC_IER_DTOE_Pos                     _UINT32_(20)                                         /* (HSMC_IER) Data Timeout Error Interrupt Enable Position */
#define HSMC_IER_DTOE_Msk                     (_UINT32_(0x1) << HSMC_IER_DTOE_Pos)                 /* (HSMC_IER) Data Timeout Error Interrupt Enable Mask */
#define HSMC_IER_DTOE(value)                  (HSMC_IER_DTOE_Msk & (_UINT32_(value) << HSMC_IER_DTOE_Pos)) /* Assigment of value for DTOE in the HSMC_IER register */
#define HSMC_IER_UNDEF_Pos                    _UINT32_(21)                                         /* (HSMC_IER) Undefined Area Access Interrupt Enable Position */
#define HSMC_IER_UNDEF_Msk                    (_UINT32_(0x1) << HSMC_IER_UNDEF_Pos)                /* (HSMC_IER) Undefined Area Access Interrupt Enable Mask */
#define HSMC_IER_UNDEF(value)                 (HSMC_IER_UNDEF_Msk & (_UINT32_(value) << HSMC_IER_UNDEF_Pos)) /* Assigment of value for UNDEF in the HSMC_IER register */
#define HSMC_IER_AWB_Pos                      _UINT32_(22)                                         /* (HSMC_IER) Accessing While Busy Interrupt Enable Position */
#define HSMC_IER_AWB_Msk                      (_UINT32_(0x1) << HSMC_IER_AWB_Pos)                  /* (HSMC_IER) Accessing While Busy Interrupt Enable Mask */
#define HSMC_IER_AWB(value)                   (HSMC_IER_AWB_Msk & (_UINT32_(value) << HSMC_IER_AWB_Pos)) /* Assigment of value for AWB in the HSMC_IER register */
#define HSMC_IER_NFCASE_Pos                   _UINT32_(23)                                         /* (HSMC_IER) NFC Access Size Error Interrupt Enable Position */
#define HSMC_IER_NFCASE_Msk                   (_UINT32_(0x1) << HSMC_IER_NFCASE_Pos)               /* (HSMC_IER) NFC Access Size Error Interrupt Enable Mask */
#define HSMC_IER_NFCASE(value)                (HSMC_IER_NFCASE_Msk & (_UINT32_(value) << HSMC_IER_NFCASE_Pos)) /* Assigment of value for NFCASE in the HSMC_IER register */
#define HSMC_IER_RB_EDGE0_Pos                 _UINT32_(24)                                         /* (HSMC_IER) Ready/Busy Line 0 Interrupt Enable Position */
#define HSMC_IER_RB_EDGE0_Msk                 (_UINT32_(0x1) << HSMC_IER_RB_EDGE0_Pos)             /* (HSMC_IER) Ready/Busy Line 0 Interrupt Enable Mask */
#define HSMC_IER_RB_EDGE0(value)              (HSMC_IER_RB_EDGE0_Msk & (_UINT32_(value) << HSMC_IER_RB_EDGE0_Pos)) /* Assigment of value for RB_EDGE0 in the HSMC_IER register */
#define HSMC_IER_Msk                          _UINT32_(0x01F30030)                                 /* (HSMC_IER) Register Mask  */

#define HSMC_IER_RB_EDGE_Pos                  _UINT32_(24)                                         /* (HSMC_IER Position) Ready/Busy Line x Interrupt Enable */
#define HSMC_IER_RB_EDGE_Msk                  (_UINT32_(0x1) << HSMC_IER_RB_EDGE_Pos)              /* (HSMC_IER Mask) RB_EDGE */
#define HSMC_IER_RB_EDGE(value)               (HSMC_IER_RB_EDGE_Msk & (_UINT32_(value) << HSMC_IER_RB_EDGE_Pos)) 

/* -------- HSMC_IMR : (SMC Offset: 0x14) ( R/ 32) NFC Interrupt Mask Register -------- */
#define HSMC_IMR_RB_RISE_Pos                  _UINT32_(4)                                          /* (HSMC_IMR) Ready Busy Rising Edge Detection Interrupt Mask Position */
#define HSMC_IMR_RB_RISE_Msk                  (_UINT32_(0x1) << HSMC_IMR_RB_RISE_Pos)              /* (HSMC_IMR) Ready Busy Rising Edge Detection Interrupt Mask Mask */
#define HSMC_IMR_RB_RISE(value)               (HSMC_IMR_RB_RISE_Msk & (_UINT32_(value) << HSMC_IMR_RB_RISE_Pos)) /* Assigment of value for RB_RISE in the HSMC_IMR register */
#define HSMC_IMR_RB_FALL_Pos                  _UINT32_(5)                                          /* (HSMC_IMR) Ready Busy Falling Edge Detection Interrupt Mask Position */
#define HSMC_IMR_RB_FALL_Msk                  (_UINT32_(0x1) << HSMC_IMR_RB_FALL_Pos)              /* (HSMC_IMR) Ready Busy Falling Edge Detection Interrupt Mask Mask */
#define HSMC_IMR_RB_FALL(value)               (HSMC_IMR_RB_FALL_Msk & (_UINT32_(value) << HSMC_IMR_RB_FALL_Pos)) /* Assigment of value for RB_FALL in the HSMC_IMR register */
#define HSMC_IMR_XFRDONE_Pos                  _UINT32_(16)                                         /* (HSMC_IMR) Transfer Done Interrupt Mask Position */
#define HSMC_IMR_XFRDONE_Msk                  (_UINT32_(0x1) << HSMC_IMR_XFRDONE_Pos)              /* (HSMC_IMR) Transfer Done Interrupt Mask Mask */
#define HSMC_IMR_XFRDONE(value)               (HSMC_IMR_XFRDONE_Msk & (_UINT32_(value) << HSMC_IMR_XFRDONE_Pos)) /* Assigment of value for XFRDONE in the HSMC_IMR register */
#define HSMC_IMR_CMDDONE_Pos                  _UINT32_(17)                                         /* (HSMC_IMR) Command Done Interrupt Mask Position */
#define HSMC_IMR_CMDDONE_Msk                  (_UINT32_(0x1) << HSMC_IMR_CMDDONE_Pos)              /* (HSMC_IMR) Command Done Interrupt Mask Mask */
#define HSMC_IMR_CMDDONE(value)               (HSMC_IMR_CMDDONE_Msk & (_UINT32_(value) << HSMC_IMR_CMDDONE_Pos)) /* Assigment of value for CMDDONE in the HSMC_IMR register */
#define HSMC_IMR_DTOE_Pos                     _UINT32_(20)                                         /* (HSMC_IMR) Data Timeout Error Interrupt Mask Position */
#define HSMC_IMR_DTOE_Msk                     (_UINT32_(0x1) << HSMC_IMR_DTOE_Pos)                 /* (HSMC_IMR) Data Timeout Error Interrupt Mask Mask */
#define HSMC_IMR_DTOE(value)                  (HSMC_IMR_DTOE_Msk & (_UINT32_(value) << HSMC_IMR_DTOE_Pos)) /* Assigment of value for DTOE in the HSMC_IMR register */
#define HSMC_IMR_UNDEF_Pos                    _UINT32_(21)                                         /* (HSMC_IMR) Undefined Area Access Interrupt Mask5 Position */
#define HSMC_IMR_UNDEF_Msk                    (_UINT32_(0x1) << HSMC_IMR_UNDEF_Pos)                /* (HSMC_IMR) Undefined Area Access Interrupt Mask5 Mask */
#define HSMC_IMR_UNDEF(value)                 (HSMC_IMR_UNDEF_Msk & (_UINT32_(value) << HSMC_IMR_UNDEF_Pos)) /* Assigment of value for UNDEF in the HSMC_IMR register */
#define HSMC_IMR_AWB_Pos                      _UINT32_(22)                                         /* (HSMC_IMR) Accessing While Busy Interrupt Mask Position */
#define HSMC_IMR_AWB_Msk                      (_UINT32_(0x1) << HSMC_IMR_AWB_Pos)                  /* (HSMC_IMR) Accessing While Busy Interrupt Mask Mask */
#define HSMC_IMR_AWB(value)                   (HSMC_IMR_AWB_Msk & (_UINT32_(value) << HSMC_IMR_AWB_Pos)) /* Assigment of value for AWB in the HSMC_IMR register */
#define HSMC_IMR_NFCASE_Pos                   _UINT32_(23)                                         /* (HSMC_IMR) NFC Access Size Error Interrupt Mask Position */
#define HSMC_IMR_NFCASE_Msk                   (_UINT32_(0x1) << HSMC_IMR_NFCASE_Pos)               /* (HSMC_IMR) NFC Access Size Error Interrupt Mask Mask */
#define HSMC_IMR_NFCASE(value)                (HSMC_IMR_NFCASE_Msk & (_UINT32_(value) << HSMC_IMR_NFCASE_Pos)) /* Assigment of value for NFCASE in the HSMC_IMR register */
#define HSMC_IMR_RB_EDGE0_Pos                 _UINT32_(24)                                         /* (HSMC_IMR) Ready/Busy Line 0 Interrupt Mask Position */
#define HSMC_IMR_RB_EDGE0_Msk                 (_UINT32_(0x1) << HSMC_IMR_RB_EDGE0_Pos)             /* (HSMC_IMR) Ready/Busy Line 0 Interrupt Mask Mask */
#define HSMC_IMR_RB_EDGE0(value)              (HSMC_IMR_RB_EDGE0_Msk & (_UINT32_(value) << HSMC_IMR_RB_EDGE0_Pos)) /* Assigment of value for RB_EDGE0 in the HSMC_IMR register */
#define HSMC_IMR_Msk                          _UINT32_(0x01F30030)                                 /* (HSMC_IMR) Register Mask  */

