Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/tc/tc_compare_mode/firmware/src/packs/ATSAMA5D29_DFP/component/smc.h
#define HSMC_IMR_RB_EDGE_Pos                  _UINT32_(24)                                         /* (HSMC_IMR Position) Ready/Busy Line x Interrupt Mask */
#define HSMC_IMR_RB_EDGE_Msk                  (_UINT32_(0x1) << HSMC_IMR_RB_EDGE_Pos)              /* (HSMC_IMR Mask) RB_EDGE */
#define HSMC_IMR_RB_EDGE(value)               (HSMC_IMR_RB_EDGE_Msk & (_UINT32_(value) << HSMC_IMR_RB_EDGE_Pos)) 

/* -------- HSMC_KEY1 : (SMC Offset: 0x7A4) ( /W 32) Off Chip Memory Scrambling KEY1 Register -------- */
#define HSMC_KEY1_KEY1_Pos                    _UINT32_(0)                                          /* (HSMC_KEY1) Off Chip Memory Scrambling (OCMS) Key Part 1 Position */
#define HSMC_KEY1_KEY1_Msk                    (_UINT32_(0xFFFFFFFF) << HSMC_KEY1_KEY1_Pos)         /* (HSMC_KEY1) Off Chip Memory Scrambling (OCMS) Key Part 1 Mask */
#define HSMC_KEY1_KEY1(value)                 (HSMC_KEY1_KEY1_Msk & (_UINT32_(value) << HSMC_KEY1_KEY1_Pos)) /* Assigment of value for KEY1 in the HSMC_KEY1 register */
#define HSMC_KEY1_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (HSMC_KEY1) Register Mask  */


/* -------- HSMC_KEY2 : (SMC Offset: 0x7A8) ( /W 32) Off Chip Memory Scrambling KEY2 Register -------- */
#define HSMC_KEY2_KEY2_Pos                    _UINT32_(0)                                          /* (HSMC_KEY2) Off Chip Memory Scrambling (OCMS) Key Part 2 Position */
#define HSMC_KEY2_KEY2_Msk                    (_UINT32_(0xFFFFFFFF) << HSMC_KEY2_KEY2_Pos)         /* (HSMC_KEY2) Off Chip Memory Scrambling (OCMS) Key Part 2 Mask */
#define HSMC_KEY2_KEY2(value)                 (HSMC_KEY2_KEY2_Msk & (_UINT32_(value) << HSMC_KEY2_KEY2_Pos)) /* Assigment of value for KEY2 in the HSMC_KEY2 register */
#define HSMC_KEY2_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (HSMC_KEY2) Register Mask  */


/* -------- HSMC_OCMS : (SMC Offset: 0x7A0) (R/W 32) Off Chip Memory Scrambling Register -------- */
#define HSMC_OCMS_SMSE_Pos                    _UINT32_(0)                                          /* (HSMC_OCMS) Static Memory Controller Scrambling Enable Position */
#define HSMC_OCMS_SMSE_Msk                    (_UINT32_(0x1) << HSMC_OCMS_SMSE_Pos)                /* (HSMC_OCMS) Static Memory Controller Scrambling Enable Mask */
#define HSMC_OCMS_SMSE(value)                 (HSMC_OCMS_SMSE_Msk & (_UINT32_(value) << HSMC_OCMS_SMSE_Pos)) /* Assigment of value for SMSE in the HSMC_OCMS register */
#define HSMC_OCMS_SRSE_Pos                    _UINT32_(1)                                          /* (HSMC_OCMS) NFC Internal SRAM Scrambling Enable Position */
#define HSMC_OCMS_SRSE_Msk                    (_UINT32_(0x1) << HSMC_OCMS_SRSE_Pos)                /* (HSMC_OCMS) NFC Internal SRAM Scrambling Enable Mask */
#define HSMC_OCMS_SRSE(value)                 (HSMC_OCMS_SRSE_Msk & (_UINT32_(value) << HSMC_OCMS_SRSE_Pos)) /* Assigment of value for SRSE in the HSMC_OCMS register */
#define HSMC_OCMS_Msk                         _UINT32_(0x00000003)                                 /* (HSMC_OCMS) Register Mask  */


/* -------- HSMC_PMECCEADDR : (SMC Offset: 0x7C) (R/W 32) PMECC End Address Register -------- */
#define HSMC_PMECCEADDR_ENDADDR_Pos           _UINT32_(0)                                          /* (HSMC_PMECCEADDR) ECC Area End Address Position */
#define HSMC_PMECCEADDR_ENDADDR_Msk           (_UINT32_(0x1FF) << HSMC_PMECCEADDR_ENDADDR_Pos)     /* (HSMC_PMECCEADDR) ECC Area End Address Mask */
#define HSMC_PMECCEADDR_ENDADDR(value)        (HSMC_PMECCEADDR_ENDADDR_Msk & (_UINT32_(value) << HSMC_PMECCEADDR_ENDADDR_Pos)) /* Assigment of value for ENDADDR in the HSMC_PMECCEADDR register */
#define HSMC_PMECCEADDR_Msk                   _UINT32_(0x000001FF)                                 /* (HSMC_PMECCEADDR) Register Mask  */


/* -------- HSMC_PMECCFG : (SMC Offset: 0x70) (R/W 32) PMECC Configuration Register -------- */
#define HSMC_PMECCFG_BCH_ERR_Pos              _UINT32_(0)                                          /* (HSMC_PMECCFG) Error Correcting Capability Position */
#define HSMC_PMECCFG_BCH_ERR_Msk              (_UINT32_(0x7) << HSMC_PMECCFG_BCH_ERR_Pos)          /* (HSMC_PMECCFG) Error Correcting Capability Mask */
#define HSMC_PMECCFG_BCH_ERR(value)           (HSMC_PMECCFG_BCH_ERR_Msk & (_UINT32_(value) << HSMC_PMECCFG_BCH_ERR_Pos)) /* Assigment of value for BCH_ERR in the HSMC_PMECCFG register */
#define   HSMC_PMECCFG_BCH_ERR_BCH_ERR2_Val   _UINT32_(0x0)                                        /* (HSMC_PMECCFG) 2 errors  */
#define   HSMC_PMECCFG_BCH_ERR_BCH_ERR4_Val   _UINT32_(0x1)                                        /* (HSMC_PMECCFG) 4 errors  */
#define   HSMC_PMECCFG_BCH_ERR_BCH_ERR8_Val   _UINT32_(0x2)                                        /* (HSMC_PMECCFG) 8 errors  */
#define   HSMC_PMECCFG_BCH_ERR_BCH_ERR12_Val  _UINT32_(0x3)                                        /* (HSMC_PMECCFG) 12 errors  */
#define   HSMC_PMECCFG_BCH_ERR_BCH_ERR24_Val  _UINT32_(0x4)                                        /* (HSMC_PMECCFG) 24 errors  */
#define   HSMC_PMECCFG_BCH_ERR_BCH_ERR32_Val  _UINT32_(0x5)                                        /* (HSMC_PMECCFG) 32 errors  */
#define HSMC_PMECCFG_BCH_ERR_BCH_ERR2         (HSMC_PMECCFG_BCH_ERR_BCH_ERR2_Val << HSMC_PMECCFG_BCH_ERR_Pos) /* (HSMC_PMECCFG) 2 errors Position  */
#define HSMC_PMECCFG_BCH_ERR_BCH_ERR4         (HSMC_PMECCFG_BCH_ERR_BCH_ERR4_Val << HSMC_PMECCFG_BCH_ERR_Pos) /* (HSMC_PMECCFG) 4 errors Position  */
#define HSMC_PMECCFG_BCH_ERR_BCH_ERR8         (HSMC_PMECCFG_BCH_ERR_BCH_ERR8_Val << HSMC_PMECCFG_BCH_ERR_Pos) /* (HSMC_PMECCFG) 8 errors Position  */
#define HSMC_PMECCFG_BCH_ERR_BCH_ERR12        (HSMC_PMECCFG_BCH_ERR_BCH_ERR12_Val << HSMC_PMECCFG_BCH_ERR_Pos) /* (HSMC_PMECCFG) 12 errors Position  */
#define HSMC_PMECCFG_BCH_ERR_BCH_ERR24        (HSMC_PMECCFG_BCH_ERR_BCH_ERR24_Val << HSMC_PMECCFG_BCH_ERR_Pos) /* (HSMC_PMECCFG) 24 errors Position  */
#define HSMC_PMECCFG_BCH_ERR_BCH_ERR32        (HSMC_PMECCFG_BCH_ERR_BCH_ERR32_Val << HSMC_PMECCFG_BCH_ERR_Pos) /* (HSMC_PMECCFG) 32 errors Position  */
#define HSMC_PMECCFG_SECTORSZ_Pos             _UINT32_(4)                                          /* (HSMC_PMECCFG) Sector Size Position */
#define HSMC_PMECCFG_SECTORSZ_Msk             (_UINT32_(0x1) << HSMC_PMECCFG_SECTORSZ_Pos)         /* (HSMC_PMECCFG) Sector Size Mask */
#define HSMC_PMECCFG_SECTORSZ(value)          (HSMC_PMECCFG_SECTORSZ_Msk & (_UINT32_(value) << HSMC_PMECCFG_SECTORSZ_Pos)) /* Assigment of value for SECTORSZ in the HSMC_PMECCFG register */
#define   HSMC_PMECCFG_SECTORSZ_SECTORSZ0_Val _UINT32_(0x0)                                        /* (HSMC_PMECCFG) Use  512 Byte Sector in ECC Computation  */
#define   HSMC_PMECCFG_SECTORSZ_SECTORSZ1_Val _UINT32_(0x1)                                        /* (HSMC_PMECCFG) Use 1024 Byte Sector in ECC Computation  */
#define HSMC_PMECCFG_SECTORSZ_SECTORSZ0       (HSMC_PMECCFG_SECTORSZ_SECTORSZ0_Val << HSMC_PMECCFG_SECTORSZ_Pos) /* (HSMC_PMECCFG) Use  512 Byte Sector in ECC Computation Position  */
#define HSMC_PMECCFG_SECTORSZ_SECTORSZ1       (HSMC_PMECCFG_SECTORSZ_SECTORSZ1_Val << HSMC_PMECCFG_SECTORSZ_Pos) /* (HSMC_PMECCFG) Use 1024 Byte Sector in ECC Computation Position  */
#define HSMC_PMECCFG_PAGESIZE_Pos             _UINT32_(8)                                          /* (HSMC_PMECCFG) Number of Sectors in the Page Position */
#define HSMC_PMECCFG_PAGESIZE_Msk             (_UINT32_(0x3) << HSMC_PMECCFG_PAGESIZE_Pos)         /* (HSMC_PMECCFG) Number of Sectors in the Page Mask */
#define HSMC_PMECCFG_PAGESIZE(value)          (HSMC_PMECCFG_PAGESIZE_Msk & (_UINT32_(value) << HSMC_PMECCFG_PAGESIZE_Pos)) /* Assigment of value for PAGESIZE in the HSMC_PMECCFG register */
#define   HSMC_PMECCFG_PAGESIZE_PAGESIZE_1SEC_Val _UINT32_(0x0)                                        /* (HSMC_PMECCFG) 1 sector for main area (512 or 1024 bytes)  */
#define   HSMC_PMECCFG_PAGESIZE_PAGESIZE_2SEC_Val _UINT32_(0x1)                                        /* (HSMC_PMECCFG) 2 sectors for main area (1024 or 2048 bytes)  */
#define   HSMC_PMECCFG_PAGESIZE_PAGESIZE_4SEC_Val _UINT32_(0x2)                                        /* (HSMC_PMECCFG) 4 sectors for main area (2048 or 4096 bytes)  */
#define   HSMC_PMECCFG_PAGESIZE_PAGESIZE_8SEC_Val _UINT32_(0x3)                                        /* (HSMC_PMECCFG) 8 sectors for main area (4096 or 8192 bytes)  */
#define HSMC_PMECCFG_PAGESIZE_PAGESIZE_1SEC   (HSMC_PMECCFG_PAGESIZE_PAGESIZE_1SEC_Val << HSMC_PMECCFG_PAGESIZE_Pos) /* (HSMC_PMECCFG) 1 sector for main area (512 or 1024 bytes) Position  */
#define HSMC_PMECCFG_PAGESIZE_PAGESIZE_2SEC   (HSMC_PMECCFG_PAGESIZE_PAGESIZE_2SEC_Val << HSMC_PMECCFG_PAGESIZE_Pos) /* (HSMC_PMECCFG) 2 sectors for main area (1024 or 2048 bytes) Position  */
#define HSMC_PMECCFG_PAGESIZE_PAGESIZE_4SEC   (HSMC_PMECCFG_PAGESIZE_PAGESIZE_4SEC_Val << HSMC_PMECCFG_PAGESIZE_Pos) /* (HSMC_PMECCFG) 4 sectors for main area (2048 or 4096 bytes) Position  */
#define HSMC_PMECCFG_PAGESIZE_PAGESIZE_8SEC   (HSMC_PMECCFG_PAGESIZE_PAGESIZE_8SEC_Val << HSMC_PMECCFG_PAGESIZE_Pos) /* (HSMC_PMECCFG) 8 sectors for main area (4096 or 8192 bytes) Position  */
#define HSMC_PMECCFG_NANDWR_Pos               _UINT32_(12)                                         /* (HSMC_PMECCFG) NAND Write Access Position */
#define HSMC_PMECCFG_NANDWR_Msk               (_UINT32_(0x1) << HSMC_PMECCFG_NANDWR_Pos)           /* (HSMC_PMECCFG) NAND Write Access Mask */
#define HSMC_PMECCFG_NANDWR(value)            (HSMC_PMECCFG_NANDWR_Msk & (_UINT32_(value) << HSMC_PMECCFG_NANDWR_Pos)) /* Assigment of value for NANDWR in the HSMC_PMECCFG register */
#define HSMC_PMECCFG_SPAREEN_Pos              _UINT32_(16)                                         /* (HSMC_PMECCFG) Spare Enable Position */
#define HSMC_PMECCFG_SPAREEN_Msk              (_UINT32_(0x1) << HSMC_PMECCFG_SPAREEN_Pos)          /* (HSMC_PMECCFG) Spare Enable Mask */
#define HSMC_PMECCFG_SPAREEN(value)           (HSMC_PMECCFG_SPAREEN_Msk & (_UINT32_(value) << HSMC_PMECCFG_SPAREEN_Pos)) /* Assigment of value for SPAREEN in the HSMC_PMECCFG register */
#define HSMC_PMECCFG_AUTO_Pos                 _UINT32_(20)                                         /* (HSMC_PMECCFG) Automatic Mode Enable Position */
#define HSMC_PMECCFG_AUTO_Msk                 (_UINT32_(0x1) << HSMC_PMECCFG_AUTO_Pos)             /* (HSMC_PMECCFG) Automatic Mode Enable Mask */
#define HSMC_PMECCFG_AUTO(value)              (HSMC_PMECCFG_AUTO_Msk & (_UINT32_(value) << HSMC_PMECCFG_AUTO_Pos)) /* Assigment of value for AUTO in the HSMC_PMECCFG register */
#define HSMC_PMECCFG_Msk                      _UINT32_(0x00111317)                                 /* (HSMC_PMECCFG) Register Mask  */


/* -------- HSMC_PMECCIDR : (SMC Offset: 0x90) ( /W 32) PMECC Interrupt Disable Register -------- */
#define HSMC_PMECCIDR_ERRID_Pos               _UINT32_(0)                                          /* (HSMC_PMECCIDR) Error Interrupt Disable Position */
#define HSMC_PMECCIDR_ERRID_Msk               (_UINT32_(0x1) << HSMC_PMECCIDR_ERRID_Pos)           /* (HSMC_PMECCIDR) Error Interrupt Disable Mask */
#define HSMC_PMECCIDR_ERRID(value)            (HSMC_PMECCIDR_ERRID_Msk & (_UINT32_(value) << HSMC_PMECCIDR_ERRID_Pos)) /* Assigment of value for ERRID in the HSMC_PMECCIDR register */
#define HSMC_PMECCIDR_Msk                     _UINT32_(0x00000001)                                 /* (HSMC_PMECCIDR) Register Mask  */


/* -------- HSMC_PMECCIER : (SMC Offset: 0x8C) ( /W 32) PMECC Interrupt Enable register -------- */
#define HSMC_PMECCIER_ERRIE_Pos               _UINT32_(0)                                          /* (HSMC_PMECCIER) Error Interrupt Enable Position */
#define HSMC_PMECCIER_ERRIE_Msk               (_UINT32_(0x1) << HSMC_PMECCIER_ERRIE_Pos)           /* (HSMC_PMECCIER) Error Interrupt Enable Mask */
#define HSMC_PMECCIER_ERRIE(value)            (HSMC_PMECCIER_ERRIE_Msk & (_UINT32_(value) << HSMC_PMECCIER_ERRIE_Pos)) /* Assigment of value for ERRIE in the HSMC_PMECCIER register */
#define HSMC_PMECCIER_Msk                     _UINT32_(0x00000001)                                 /* (HSMC_PMECCIER) Register Mask  */


/* -------- HSMC_PMECCIMR : (SMC Offset: 0x94) ( R/ 32) PMECC Interrupt Mask Register -------- */
#define HSMC_PMECCIMR_ERRIM_Pos               _UINT32_(0)                                          /* (HSMC_PMECCIMR) Error Interrupt Mask Position */
#define HSMC_PMECCIMR_ERRIM_Msk               (_UINT32_(0x1) << HSMC_PMECCIMR_ERRIM_Pos)           /* (HSMC_PMECCIMR) Error Interrupt Mask Mask */
#define HSMC_PMECCIMR_ERRIM(value)            (HSMC_PMECCIMR_ERRIM_Msk & (_UINT32_(value) << HSMC_PMECCIMR_ERRIM_Pos)) /* Assigment of value for ERRIM in the HSMC_PMECCIMR register */
#define HSMC_PMECCIMR_Msk                     _UINT32_(0x00000001)                                 /* (HSMC_PMECCIMR) Register Mask  */


