Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/tc/tc_compare_mode/firmware/src/packs/ATSAMA5D29_DFP/component/smc.h
/* -------- HSMC_PMECCISR : (SMC Offset: 0x98) ( R/ 32) PMECC Interrupt Status Register -------- */
#define HSMC_PMECCISR_ERRIS_Pos               _UINT32_(0)                                          /* (HSMC_PMECCISR) Error Interrupt Status Register Position */
#define HSMC_PMECCISR_ERRIS_Msk               (_UINT32_(0xFF) << HSMC_PMECCISR_ERRIS_Pos)          /* (HSMC_PMECCISR) Error Interrupt Status Register Mask */
#define HSMC_PMECCISR_ERRIS(value)            (HSMC_PMECCISR_ERRIS_Msk & (_UINT32_(value) << HSMC_PMECCISR_ERRIS_Pos)) /* Assigment of value for ERRIS in the HSMC_PMECCISR register */
#define HSMC_PMECCISR_Msk                     _UINT32_(0x000000FF)                                 /* (HSMC_PMECCISR) Register Mask  */


/* -------- HSMC_PMECCSADDR : (SMC Offset: 0x78) (R/W 32) PMECC Start Address Register -------- */
#define HSMC_PMECCSADDR_STARTADDR_Pos         _UINT32_(0)                                          /* (HSMC_PMECCSADDR) ECC Area Start Address Position */
#define HSMC_PMECCSADDR_STARTADDR_Msk         (_UINT32_(0x1FF) << HSMC_PMECCSADDR_STARTADDR_Pos)   /* (HSMC_PMECCSADDR) ECC Area Start Address Mask */
#define HSMC_PMECCSADDR_STARTADDR(value)      (HSMC_PMECCSADDR_STARTADDR_Msk & (_UINT32_(value) << HSMC_PMECCSADDR_STARTADDR_Pos)) /* Assigment of value for STARTADDR in the HSMC_PMECCSADDR register */
#define HSMC_PMECCSADDR_Msk                   _UINT32_(0x000001FF)                                 /* (HSMC_PMECCSADDR) Register Mask  */


/* -------- HSMC_PMECCSAREA : (SMC Offset: 0x74) (R/W 32) PMECC Spare Area Size Register -------- */
#define HSMC_PMECCSAREA_SPARESIZE_Pos         _UINT32_(0)                                          /* (HSMC_PMECCSAREA) Spare Area Size Position */
#define HSMC_PMECCSAREA_SPARESIZE_Msk         (_UINT32_(0x1FF) << HSMC_PMECCSAREA_SPARESIZE_Pos)   /* (HSMC_PMECCSAREA) Spare Area Size Mask */
#define HSMC_PMECCSAREA_SPARESIZE(value)      (HSMC_PMECCSAREA_SPARESIZE_Msk & (_UINT32_(value) << HSMC_PMECCSAREA_SPARESIZE_Pos)) /* Assigment of value for SPARESIZE in the HSMC_PMECCSAREA register */
#define HSMC_PMECCSAREA_Msk                   _UINT32_(0x000001FF)                                 /* (HSMC_PMECCSAREA) Register Mask  */


/* -------- HSMC_PMECCSR : (SMC Offset: 0x88) ( R/ 32) PMECC Status Register -------- */
#define HSMC_PMECCSR_BUSY_Pos                 _UINT32_(0)                                          /* (HSMC_PMECCSR) The kernel of the PMECC is busy Position */
#define HSMC_PMECCSR_BUSY_Msk                 (_UINT32_(0x1) << HSMC_PMECCSR_BUSY_Pos)             /* (HSMC_PMECCSR) The kernel of the PMECC is busy Mask */
#define HSMC_PMECCSR_BUSY(value)              (HSMC_PMECCSR_BUSY_Msk & (_UINT32_(value) << HSMC_PMECCSR_BUSY_Pos)) /* Assigment of value for BUSY in the HSMC_PMECCSR register */
#define HSMC_PMECCSR_ENABLE_Pos               _UINT32_(4)                                          /* (HSMC_PMECCSR) PMECC Enable bit Position */
#define HSMC_PMECCSR_ENABLE_Msk               (_UINT32_(0x1) << HSMC_PMECCSR_ENABLE_Pos)           /* (HSMC_PMECCSR) PMECC Enable bit Mask */
#define HSMC_PMECCSR_ENABLE(value)            (HSMC_PMECCSR_ENABLE_Msk & (_UINT32_(value) << HSMC_PMECCSR_ENABLE_Pos)) /* Assigment of value for ENABLE in the HSMC_PMECCSR register */
#define HSMC_PMECCSR_Msk                      _UINT32_(0x00000011)                                 /* (HSMC_PMECCSR) Register Mask  */


/* -------- HSMC_PMECCTRL : (SMC Offset: 0x84) ( /W 32) PMECC Control Register -------- */
#define HSMC_PMECCTRL_RST_Pos                 _UINT32_(0)                                          /* (HSMC_PMECCTRL) Reset the PMECC Module Position */
#define HSMC_PMECCTRL_RST_Msk                 (_UINT32_(0x1) << HSMC_PMECCTRL_RST_Pos)             /* (HSMC_PMECCTRL) Reset the PMECC Module Mask */
#define HSMC_PMECCTRL_RST(value)              (HSMC_PMECCTRL_RST_Msk & (_UINT32_(value) << HSMC_PMECCTRL_RST_Pos)) /* Assigment of value for RST in the HSMC_PMECCTRL register */
#define HSMC_PMECCTRL_DATA_Pos                _UINT32_(1)                                          /* (HSMC_PMECCTRL) Start a Data Phase Position */
#define HSMC_PMECCTRL_DATA_Msk                (_UINT32_(0x1) << HSMC_PMECCTRL_DATA_Pos)            /* (HSMC_PMECCTRL) Start a Data Phase Mask */
#define HSMC_PMECCTRL_DATA(value)             (HSMC_PMECCTRL_DATA_Msk & (_UINT32_(value) << HSMC_PMECCTRL_DATA_Pos)) /* Assigment of value for DATA in the HSMC_PMECCTRL register */
#define HSMC_PMECCTRL_USER_Pos                _UINT32_(2)                                          /* (HSMC_PMECCTRL) Start a User Mode Phase Position */
#define HSMC_PMECCTRL_USER_Msk                (_UINT32_(0x1) << HSMC_PMECCTRL_USER_Pos)            /* (HSMC_PMECCTRL) Start a User Mode Phase Mask */
#define HSMC_PMECCTRL_USER(value)             (HSMC_PMECCTRL_USER_Msk & (_UINT32_(value) << HSMC_PMECCTRL_USER_Pos)) /* Assigment of value for USER in the HSMC_PMECCTRL register */
#define HSMC_PMECCTRL_ENABLE_Pos              _UINT32_(4)                                          /* (HSMC_PMECCTRL) PMECC Enable Position */
#define HSMC_PMECCTRL_ENABLE_Msk              (_UINT32_(0x1) << HSMC_PMECCTRL_ENABLE_Pos)          /* (HSMC_PMECCTRL) PMECC Enable Mask */
#define HSMC_PMECCTRL_ENABLE(value)           (HSMC_PMECCTRL_ENABLE_Msk & (_UINT32_(value) << HSMC_PMECCTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the HSMC_PMECCTRL register */
#define HSMC_PMECCTRL_DISABLE_Pos             _UINT32_(5)                                          /* (HSMC_PMECCTRL) PMECC Enable Position */
#define HSMC_PMECCTRL_DISABLE_Msk             (_UINT32_(0x1) << HSMC_PMECCTRL_DISABLE_Pos)         /* (HSMC_PMECCTRL) PMECC Enable Mask */
#define HSMC_PMECCTRL_DISABLE(value)          (HSMC_PMECCTRL_DISABLE_Msk & (_UINT32_(value) << HSMC_PMECCTRL_DISABLE_Pos)) /* Assigment of value for DISABLE in the HSMC_PMECCTRL register */
#define HSMC_PMECCTRL_Msk                     _UINT32_(0x00000037)                                 /* (HSMC_PMECCTRL) Register Mask  */


/* -------- HSMC_SIGMA0 : (SMC Offset: 0x528) ( R/ 32) PMECC Error Location SIGMA 0 Register -------- */
#define HSMC_SIGMA0_SIGMA0_Pos                _UINT32_(0)                                          /* (HSMC_SIGMA0) Coefficient of degree 0 in the SIGMA polynomial Position */
#define HSMC_SIGMA0_SIGMA0_Msk                (_UINT32_(0x3FFF) << HSMC_SIGMA0_SIGMA0_Pos)         /* (HSMC_SIGMA0) Coefficient of degree 0 in the SIGMA polynomial Mask */
#define HSMC_SIGMA0_SIGMA0(value)             (HSMC_SIGMA0_SIGMA0_Msk & (_UINT32_(value) << HSMC_SIGMA0_SIGMA0_Pos)) /* Assigment of value for SIGMA0 in the HSMC_SIGMA0 register */
#define HSMC_SIGMA0_Msk                       _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA0) Register Mask  */


/* -------- HSMC_SIGMA1 : (SMC Offset: 0x52C) (R/W 32) PMECC Error Location SIGMA 1 Register -------- */
#define HSMC_SIGMA1_SIGMA1_Pos                _UINT32_(0)                                          /* (HSMC_SIGMA1) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA1_SIGMA1_Msk                (_UINT32_(0x3FFF) << HSMC_SIGMA1_SIGMA1_Pos)         /* (HSMC_SIGMA1) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA1_SIGMA1(value)             (HSMC_SIGMA1_SIGMA1_Msk & (_UINT32_(value) << HSMC_SIGMA1_SIGMA1_Pos)) /* Assigment of value for SIGMA1 in the HSMC_SIGMA1 register */
#define HSMC_SIGMA1_Msk                       _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA1) Register Mask  */


/* -------- HSMC_SIGMA10 : (SMC Offset: 0x550) (R/W 32) PMECC Error Location SIGMA 10 Register -------- */
#define HSMC_SIGMA10_SIGMA10_Pos              _UINT32_(0)                                          /* (HSMC_SIGMA10) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA10_SIGMA10_Msk              (_UINT32_(0x3FFF) << HSMC_SIGMA10_SIGMA10_Pos)       /* (HSMC_SIGMA10) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA10_SIGMA10(value)           (HSMC_SIGMA10_SIGMA10_Msk & (_UINT32_(value) << HSMC_SIGMA10_SIGMA10_Pos)) /* Assigment of value for SIGMA10 in the HSMC_SIGMA10 register */
#define HSMC_SIGMA10_Msk                      _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA10) Register Mask  */


/* -------- HSMC_SIGMA11 : (SMC Offset: 0x554) (R/W 32) PMECC Error Location SIGMA 11 Register -------- */
#define HSMC_SIGMA11_SIGMA11_Pos              _UINT32_(0)                                          /* (HSMC_SIGMA11) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA11_SIGMA11_Msk              (_UINT32_(0x3FFF) << HSMC_SIGMA11_SIGMA11_Pos)       /* (HSMC_SIGMA11) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA11_SIGMA11(value)           (HSMC_SIGMA11_SIGMA11_Msk & (_UINT32_(value) << HSMC_SIGMA11_SIGMA11_Pos)) /* Assigment of value for SIGMA11 in the HSMC_SIGMA11 register */
#define HSMC_SIGMA11_Msk                      _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA11) Register Mask  */


/* -------- HSMC_SIGMA12 : (SMC Offset: 0x558) (R/W 32) PMECC Error Location SIGMA 12 Register -------- */
#define HSMC_SIGMA12_SIGMA12_Pos              _UINT32_(0)                                          /* (HSMC_SIGMA12) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA12_SIGMA12_Msk              (_UINT32_(0x3FFF) << HSMC_SIGMA12_SIGMA12_Pos)       /* (HSMC_SIGMA12) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA12_SIGMA12(value)           (HSMC_SIGMA12_SIGMA12_Msk & (_UINT32_(value) << HSMC_SIGMA12_SIGMA12_Pos)) /* Assigment of value for SIGMA12 in the HSMC_SIGMA12 register */
#define HSMC_SIGMA12_Msk                      _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA12) Register Mask  */


/* -------- HSMC_SIGMA13 : (SMC Offset: 0x55C) (R/W 32) PMECC Error Location SIGMA 13 Register -------- */
#define HSMC_SIGMA13_SIGMA13_Pos              _UINT32_(0)                                          /* (HSMC_SIGMA13) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA13_SIGMA13_Msk              (_UINT32_(0x3FFF) << HSMC_SIGMA13_SIGMA13_Pos)       /* (HSMC_SIGMA13) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA13_SIGMA13(value)           (HSMC_SIGMA13_SIGMA13_Msk & (_UINT32_(value) << HSMC_SIGMA13_SIGMA13_Pos)) /* Assigment of value for SIGMA13 in the HSMC_SIGMA13 register */
#define HSMC_SIGMA13_Msk                      _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA13) Register Mask  */


/* -------- HSMC_SIGMA14 : (SMC Offset: 0x560) (R/W 32) PMECC Error Location SIGMA 14 Register -------- */
#define HSMC_SIGMA14_SIGMA14_Pos              _UINT32_(0)                                          /* (HSMC_SIGMA14) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA14_SIGMA14_Msk              (_UINT32_(0x3FFF) << HSMC_SIGMA14_SIGMA14_Pos)       /* (HSMC_SIGMA14) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA14_SIGMA14(value)           (HSMC_SIGMA14_SIGMA14_Msk & (_UINT32_(value) << HSMC_SIGMA14_SIGMA14_Pos)) /* Assigment of value for SIGMA14 in the HSMC_SIGMA14 register */
#define HSMC_SIGMA14_Msk                      _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA14) Register Mask  */


/* -------- HSMC_SIGMA15 : (SMC Offset: 0x564) (R/W 32) PMECC Error Location SIGMA 15 Register -------- */
#define HSMC_SIGMA15_SIGMA15_Pos              _UINT32_(0)                                          /* (HSMC_SIGMA15) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA15_SIGMA15_Msk              (_UINT32_(0x3FFF) << HSMC_SIGMA15_SIGMA15_Pos)       /* (HSMC_SIGMA15) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA15_SIGMA15(value)           (HSMC_SIGMA15_SIGMA15_Msk & (_UINT32_(value) << HSMC_SIGMA15_SIGMA15_Pos)) /* Assigment of value for SIGMA15 in the HSMC_SIGMA15 register */
#define HSMC_SIGMA15_Msk                      _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA15) Register Mask  */


/* -------- HSMC_SIGMA16 : (SMC Offset: 0x568) (R/W 32) PMECC Error Location SIGMA 16 Register -------- */
#define HSMC_SIGMA16_SIGMA16_Pos              _UINT32_(0)                                          /* (HSMC_SIGMA16) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA16_SIGMA16_Msk              (_UINT32_(0x3FFF) << HSMC_SIGMA16_SIGMA16_Pos)       /* (HSMC_SIGMA16) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA16_SIGMA16(value)           (HSMC_SIGMA16_SIGMA16_Msk & (_UINT32_(value) << HSMC_SIGMA16_SIGMA16_Pos)) /* Assigment of value for SIGMA16 in the HSMC_SIGMA16 register */
#define HSMC_SIGMA16_Msk                      _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA16) Register Mask  */


/* -------- HSMC_SIGMA17 : (SMC Offset: 0x56C) (R/W 32) PMECC Error Location SIGMA 17 Register -------- */
#define HSMC_SIGMA17_SIGMA17_Pos              _UINT32_(0)                                          /* (HSMC_SIGMA17) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA17_SIGMA17_Msk              (_UINT32_(0x3FFF) << HSMC_SIGMA17_SIGMA17_Pos)       /* (HSMC_SIGMA17) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA17_SIGMA17(value)           (HSMC_SIGMA17_SIGMA17_Msk & (_UINT32_(value) << HSMC_SIGMA17_SIGMA17_Pos)) /* Assigment of value for SIGMA17 in the HSMC_SIGMA17 register */
#define HSMC_SIGMA17_Msk                      _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA17) Register Mask  */


/* -------- HSMC_SIGMA18 : (SMC Offset: 0x570) (R/W 32) PMECC Error Location SIGMA 18 Register -------- */
#define HSMC_SIGMA18_SIGMA18_Pos              _UINT32_(0)                                          /* (HSMC_SIGMA18) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA18_SIGMA18_Msk              (_UINT32_(0x3FFF) << HSMC_SIGMA18_SIGMA18_Pos)       /* (HSMC_SIGMA18) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA18_SIGMA18(value)           (HSMC_SIGMA18_SIGMA18_Msk & (_UINT32_(value) << HSMC_SIGMA18_SIGMA18_Pos)) /* Assigment of value for SIGMA18 in the HSMC_SIGMA18 register */
#define HSMC_SIGMA18_Msk                      _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA18) Register Mask  */


/* -------- HSMC_SIGMA19 : (SMC Offset: 0x574) (R/W 32) PMECC Error Location SIGMA 19 Register -------- */
#define HSMC_SIGMA19_SIGMA19_Pos              _UINT32_(0)                                          /* (HSMC_SIGMA19) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA19_SIGMA19_Msk              (_UINT32_(0x3FFF) << HSMC_SIGMA19_SIGMA19_Pos)       /* (HSMC_SIGMA19) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA19_SIGMA19(value)           (HSMC_SIGMA19_SIGMA19_Msk & (_UINT32_(value) << HSMC_SIGMA19_SIGMA19_Pos)) /* Assigment of value for SIGMA19 in the HSMC_SIGMA19 register */
#define HSMC_SIGMA19_Msk                      _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA19) Register Mask  */


/* -------- HSMC_SIGMA2 : (SMC Offset: 0x530) (R/W 32) PMECC Error Location SIGMA 2 Register -------- */
#define HSMC_SIGMA2_SIGMA2_Pos                _UINT32_(0)                                          /* (HSMC_SIGMA2) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA2_SIGMA2_Msk                (_UINT32_(0x3FFF) << HSMC_SIGMA2_SIGMA2_Pos)         /* (HSMC_SIGMA2) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA2_SIGMA2(value)             (HSMC_SIGMA2_SIGMA2_Msk & (_UINT32_(value) << HSMC_SIGMA2_SIGMA2_Pos)) /* Assigment of value for SIGMA2 in the HSMC_SIGMA2 register */
#define HSMC_SIGMA2_Msk                       _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA2) Register Mask  */


/* -------- HSMC_SIGMA20 : (SMC Offset: 0x578) (R/W 32) PMECC Error Location SIGMA 20 Register -------- */
#define HSMC_SIGMA20_SIGMA20_Pos              _UINT32_(0)                                          /* (HSMC_SIGMA20) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA20_SIGMA20_Msk              (_UINT32_(0x3FFF) << HSMC_SIGMA20_SIGMA20_Pos)       /* (HSMC_SIGMA20) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA20_SIGMA20(value)           (HSMC_SIGMA20_SIGMA20_Msk & (_UINT32_(value) << HSMC_SIGMA20_SIGMA20_Pos)) /* Assigment of value for SIGMA20 in the HSMC_SIGMA20 register */
#define HSMC_SIGMA20_Msk                      _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA20) Register Mask  */


/* -------- HSMC_SIGMA21 : (SMC Offset: 0x57C) (R/W 32) PMECC Error Location SIGMA 21 Register -------- */
#define HSMC_SIGMA21_SIGMA21_Pos              _UINT32_(0)                                          /* (HSMC_SIGMA21) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA21_SIGMA21_Msk              (_UINT32_(0x3FFF) << HSMC_SIGMA21_SIGMA21_Pos)       /* (HSMC_SIGMA21) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA21_SIGMA21(value)           (HSMC_SIGMA21_SIGMA21_Msk & (_UINT32_(value) << HSMC_SIGMA21_SIGMA21_Pos)) /* Assigment of value for SIGMA21 in the HSMC_SIGMA21 register */
#define HSMC_SIGMA21_Msk                      _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA21) Register Mask  */


