Microchip-MPLAB-Harmony/csp_apps_sam_a5d2/apps/tc/tc_compare_mode/firmware/src/packs/ATSAMA5D29_DFP/component/smc.h
/* -------- HSMC_SIGMA31 : (SMC Offset: 0x5A4) (R/W 32) PMECC Error Location SIGMA 31 Register -------- */
#define HSMC_SIGMA31_SIGMA31_Pos              _UINT32_(0)                                          /* (HSMC_SIGMA31) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA31_SIGMA31_Msk              (_UINT32_(0x3FFF) << HSMC_SIGMA31_SIGMA31_Pos)       /* (HSMC_SIGMA31) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA31_SIGMA31(value)           (HSMC_SIGMA31_SIGMA31_Msk & (_UINT32_(value) << HSMC_SIGMA31_SIGMA31_Pos)) /* Assigment of value for SIGMA31 in the HSMC_SIGMA31 register */
#define HSMC_SIGMA31_Msk                      _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA31) Register Mask  */


/* -------- HSMC_SIGMA32 : (SMC Offset: 0x5A8) (R/W 32) PMECC Error Location SIGMA 32 Register -------- */
#define HSMC_SIGMA32_SIGMA32_Pos              _UINT32_(0)                                          /* (HSMC_SIGMA32) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA32_SIGMA32_Msk              (_UINT32_(0x3FFF) << HSMC_SIGMA32_SIGMA32_Pos)       /* (HSMC_SIGMA32) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA32_SIGMA32(value)           (HSMC_SIGMA32_SIGMA32_Msk & (_UINT32_(value) << HSMC_SIGMA32_SIGMA32_Pos)) /* Assigment of value for SIGMA32 in the HSMC_SIGMA32 register */
#define HSMC_SIGMA32_Msk                      _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA32) Register Mask  */


/* -------- HSMC_SIGMA4 : (SMC Offset: 0x538) (R/W 32) PMECC Error Location SIGMA 4 Register -------- */
#define HSMC_SIGMA4_SIGMA4_Pos                _UINT32_(0)                                          /* (HSMC_SIGMA4) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA4_SIGMA4_Msk                (_UINT32_(0x3FFF) << HSMC_SIGMA4_SIGMA4_Pos)         /* (HSMC_SIGMA4) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA4_SIGMA4(value)             (HSMC_SIGMA4_SIGMA4_Msk & (_UINT32_(value) << HSMC_SIGMA4_SIGMA4_Pos)) /* Assigment of value for SIGMA4 in the HSMC_SIGMA4 register */
#define HSMC_SIGMA4_Msk                       _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA4) Register Mask  */


/* -------- HSMC_SIGMA5 : (SMC Offset: 0x53C) (R/W 32) PMECC Error Location SIGMA 5 Register -------- */
#define HSMC_SIGMA5_SIGMA5_Pos                _UINT32_(0)                                          /* (HSMC_SIGMA5) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA5_SIGMA5_Msk                (_UINT32_(0x3FFF) << HSMC_SIGMA5_SIGMA5_Pos)         /* (HSMC_SIGMA5) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA5_SIGMA5(value)             (HSMC_SIGMA5_SIGMA5_Msk & (_UINT32_(value) << HSMC_SIGMA5_SIGMA5_Pos)) /* Assigment of value for SIGMA5 in the HSMC_SIGMA5 register */
#define HSMC_SIGMA5_Msk                       _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA5) Register Mask  */


/* -------- HSMC_SIGMA6 : (SMC Offset: 0x540) (R/W 32) PMECC Error Location SIGMA 6 Register -------- */
#define HSMC_SIGMA6_SIGMA6_Pos                _UINT32_(0)                                          /* (HSMC_SIGMA6) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA6_SIGMA6_Msk                (_UINT32_(0x3FFF) << HSMC_SIGMA6_SIGMA6_Pos)         /* (HSMC_SIGMA6) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA6_SIGMA6(value)             (HSMC_SIGMA6_SIGMA6_Msk & (_UINT32_(value) << HSMC_SIGMA6_SIGMA6_Pos)) /* Assigment of value for SIGMA6 in the HSMC_SIGMA6 register */
#define HSMC_SIGMA6_Msk                       _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA6) Register Mask  */


/* -------- HSMC_SIGMA7 : (SMC Offset: 0x544) (R/W 32) PMECC Error Location SIGMA 7 Register -------- */
#define HSMC_SIGMA7_SIGMA7_Pos                _UINT32_(0)                                          /* (HSMC_SIGMA7) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA7_SIGMA7_Msk                (_UINT32_(0x3FFF) << HSMC_SIGMA7_SIGMA7_Pos)         /* (HSMC_SIGMA7) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA7_SIGMA7(value)             (HSMC_SIGMA7_SIGMA7_Msk & (_UINT32_(value) << HSMC_SIGMA7_SIGMA7_Pos)) /* Assigment of value for SIGMA7 in the HSMC_SIGMA7 register */
#define HSMC_SIGMA7_Msk                       _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA7) Register Mask  */


/* -------- HSMC_SIGMA8 : (SMC Offset: 0x548) (R/W 32) PMECC Error Location SIGMA 8 Register -------- */
#define HSMC_SIGMA8_SIGMA8_Pos                _UINT32_(0)                                          /* (HSMC_SIGMA8) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA8_SIGMA8_Msk                (_UINT32_(0x3FFF) << HSMC_SIGMA8_SIGMA8_Pos)         /* (HSMC_SIGMA8) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA8_SIGMA8(value)             (HSMC_SIGMA8_SIGMA8_Msk & (_UINT32_(value) << HSMC_SIGMA8_SIGMA8_Pos)) /* Assigment of value for SIGMA8 in the HSMC_SIGMA8 register */
#define HSMC_SIGMA8_Msk                       _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA8) Register Mask  */


/* -------- HSMC_SIGMA9 : (SMC Offset: 0x54C) (R/W 32) PMECC Error Location SIGMA 9 Register -------- */
#define HSMC_SIGMA9_SIGMA9_Pos                _UINT32_(0)                                          /* (HSMC_SIGMA9) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA9_SIGMA9_Msk                (_UINT32_(0x3FFF) << HSMC_SIGMA9_SIGMA9_Pos)         /* (HSMC_SIGMA9) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA9_SIGMA9(value)             (HSMC_SIGMA9_SIGMA9_Msk & (_UINT32_(value) << HSMC_SIGMA9_SIGMA9_Pos)) /* Assigment of value for SIGMA9 in the HSMC_SIGMA9 register */
#define HSMC_SIGMA9_Msk                       _UINT32_(0x00003FFF)                                 /* (HSMC_SIGMA9) Register Mask  */


/* -------- HSMC_SR : (SMC Offset: 0x08) ( R/ 32) NFC Status Register -------- */
#define HSMC_SR_SMCSTS_Pos                    _UINT32_(0)                                          /* (HSMC_SR) NAND Flash Controller Status (this field cannot be reset) Position */
#define HSMC_SR_SMCSTS_Msk                    (_UINT32_(0x1) << HSMC_SR_SMCSTS_Pos)                /* (HSMC_SR) NAND Flash Controller Status (this field cannot be reset) Mask */
#define HSMC_SR_SMCSTS(value)                 (HSMC_SR_SMCSTS_Msk & (_UINT32_(value) << HSMC_SR_SMCSTS_Pos)) /* Assigment of value for SMCSTS in the HSMC_SR register */
#define HSMC_SR_RB_RISE_Pos                   _UINT32_(4)                                          /* (HSMC_SR) Selected Ready Busy Rising Edge Detected Position */
#define HSMC_SR_RB_RISE_Msk                   (_UINT32_(0x1) << HSMC_SR_RB_RISE_Pos)               /* (HSMC_SR) Selected Ready Busy Rising Edge Detected Mask */
#define HSMC_SR_RB_RISE(value)                (HSMC_SR_RB_RISE_Msk & (_UINT32_(value) << HSMC_SR_RB_RISE_Pos)) /* Assigment of value for RB_RISE in the HSMC_SR register */
#define HSMC_SR_RB_FALL_Pos                   _UINT32_(5)                                          /* (HSMC_SR) Selected Ready Busy Falling Edge Detected Position */
#define HSMC_SR_RB_FALL_Msk                   (_UINT32_(0x1) << HSMC_SR_RB_FALL_Pos)               /* (HSMC_SR) Selected Ready Busy Falling Edge Detected Mask */
#define HSMC_SR_RB_FALL(value)                (HSMC_SR_RB_FALL_Msk & (_UINT32_(value) << HSMC_SR_RB_FALL_Pos)) /* Assigment of value for RB_FALL in the HSMC_SR register */
#define HSMC_SR_NFCBUSY_Pos                   _UINT32_(8)                                          /* (HSMC_SR) NFC Busy (this field cannot be reset) Position */
#define HSMC_SR_NFCBUSY_Msk                   (_UINT32_(0x1) << HSMC_SR_NFCBUSY_Pos)               /* (HSMC_SR) NFC Busy (this field cannot be reset) Mask */
#define HSMC_SR_NFCBUSY(value)                (HSMC_SR_NFCBUSY_Msk & (_UINT32_(value) << HSMC_SR_NFCBUSY_Pos)) /* Assigment of value for NFCBUSY in the HSMC_SR register */
#define HSMC_SR_NFCWR_Pos                     _UINT32_(11)                                         /* (HSMC_SR) NFC Write/Read Operation (this field cannot be reset) Position */
#define HSMC_SR_NFCWR_Msk                     (_UINT32_(0x1) << HSMC_SR_NFCWR_Pos)                 /* (HSMC_SR) NFC Write/Read Operation (this field cannot be reset) Mask */
#define HSMC_SR_NFCWR(value)                  (HSMC_SR_NFCWR_Msk & (_UINT32_(value) << HSMC_SR_NFCWR_Pos)) /* Assigment of value for NFCWR in the HSMC_SR register */
#define HSMC_SR_NFCSID_Pos                    _UINT32_(12)                                         /* (HSMC_SR) NFC Chip Select ID (this field cannot be reset) Position */
#define HSMC_SR_NFCSID_Msk                    (_UINT32_(0x7) << HSMC_SR_NFCSID_Pos)                /* (HSMC_SR) NFC Chip Select ID (this field cannot be reset) Mask */
#define HSMC_SR_NFCSID(value)                 (HSMC_SR_NFCSID_Msk & (_UINT32_(value) << HSMC_SR_NFCSID_Pos)) /* Assigment of value for NFCSID in the HSMC_SR register */
#define HSMC_SR_XFRDONE_Pos                   _UINT32_(16)                                         /* (HSMC_SR) NFC Data Transfer Terminated Position */
#define HSMC_SR_XFRDONE_Msk                   (_UINT32_(0x1) << HSMC_SR_XFRDONE_Pos)               /* (HSMC_SR) NFC Data Transfer Terminated Mask */
#define HSMC_SR_XFRDONE(value)                (HSMC_SR_XFRDONE_Msk & (_UINT32_(value) << HSMC_SR_XFRDONE_Pos)) /* Assigment of value for XFRDONE in the HSMC_SR register */
#define HSMC_SR_CMDDONE_Pos                   _UINT32_(17)                                         /* (HSMC_SR) Command Done Position */
#define HSMC_SR_CMDDONE_Msk                   (_UINT32_(0x1) << HSMC_SR_CMDDONE_Pos)               /* (HSMC_SR) Command Done Mask */
#define HSMC_SR_CMDDONE(value)                (HSMC_SR_CMDDONE_Msk & (_UINT32_(value) << HSMC_SR_CMDDONE_Pos)) /* Assigment of value for CMDDONE in the HSMC_SR register */
#define HSMC_SR_DTOE_Pos                      _UINT32_(20)                                         /* (HSMC_SR) Data Timeout Error Position */
#define HSMC_SR_DTOE_Msk                      (_UINT32_(0x1) << HSMC_SR_DTOE_Pos)                  /* (HSMC_SR) Data Timeout Error Mask */
#define HSMC_SR_DTOE(value)                   (HSMC_SR_DTOE_Msk & (_UINT32_(value) << HSMC_SR_DTOE_Pos)) /* Assigment of value for DTOE in the HSMC_SR register */
#define HSMC_SR_UNDEF_Pos                     _UINT32_(21)                                         /* (HSMC_SR) Undefined Area Error Position */
#define HSMC_SR_UNDEF_Msk                     (_UINT32_(0x1) << HSMC_SR_UNDEF_Pos)                 /* (HSMC_SR) Undefined Area Error Mask */
#define HSMC_SR_UNDEF(value)                  (HSMC_SR_UNDEF_Msk & (_UINT32_(value) << HSMC_SR_UNDEF_Pos)) /* Assigment of value for UNDEF in the HSMC_SR register */
#define HSMC_SR_AWB_Pos                       _UINT32_(22)                                         /* (HSMC_SR) Accessing While Busy Position */
#define HSMC_SR_AWB_Msk                       (_UINT32_(0x1) << HSMC_SR_AWB_Pos)                   /* (HSMC_SR) Accessing While Busy Mask */
#define HSMC_SR_AWB(value)                    (HSMC_SR_AWB_Msk & (_UINT32_(value) << HSMC_SR_AWB_Pos)) /* Assigment of value for AWB in the HSMC_SR register */
#define HSMC_SR_NFCASE_Pos                    _UINT32_(23)                                         /* (HSMC_SR) NFC Access Size Error Position */
#define HSMC_SR_NFCASE_Msk                    (_UINT32_(0x1) << HSMC_SR_NFCASE_Pos)                /* (HSMC_SR) NFC Access Size Error Mask */
#define HSMC_SR_NFCASE(value)                 (HSMC_SR_NFCASE_Msk & (_UINT32_(value) << HSMC_SR_NFCASE_Pos)) /* Assigment of value for NFCASE in the HSMC_SR register */
#define HSMC_SR_RB_EDGE0_Pos                  _UINT32_(24)                                         /* (HSMC_SR) Ready/Busy Line 0 Edge Detected Position */
#define HSMC_SR_RB_EDGE0_Msk                  (_UINT32_(0x1) << HSMC_SR_RB_EDGE0_Pos)              /* (HSMC_SR) Ready/Busy Line 0 Edge Detected Mask */
#define HSMC_SR_RB_EDGE0(value)               (HSMC_SR_RB_EDGE0_Msk & (_UINT32_(value) << HSMC_SR_RB_EDGE0_Pos)) /* Assigment of value for RB_EDGE0 in the HSMC_SR register */
#define HSMC_SR_Msk                           _UINT32_(0x01F37931)                                 /* (HSMC_SR) Register Mask  */

#define HSMC_SR_RB_EDGE_Pos                   _UINT32_(24)                                         /* (HSMC_SR Position) Ready/Busy Line x Edge Detected */
#define HSMC_SR_RB_EDGE_Msk                   (_UINT32_(0x1) << HSMC_SR_RB_EDGE_Pos)               /* (HSMC_SR Mask) RB_EDGE */
#define HSMC_SR_RB_EDGE(value)                (HSMC_SR_RB_EDGE_Msk & (_UINT32_(value) << HSMC_SR_RB_EDGE_Pos)) 

/* -------- HSMC_WPMR : (SMC Offset: 0x7E4) (R/W 32) Write Protection Mode Register -------- */
#define HSMC_WPMR_WPEN_Pos                    _UINT32_(0)                                          /* (HSMC_WPMR) Write Protection Enable Position */
#define HSMC_WPMR_WPEN_Msk                    (_UINT32_(0x1) << HSMC_WPMR_WPEN_Pos)                /* (HSMC_WPMR) Write Protection Enable Mask */
#define HSMC_WPMR_WPEN(value)                 (HSMC_WPMR_WPEN_Msk & (_UINT32_(value) << HSMC_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the HSMC_WPMR register */
#define HSMC_WPMR_WPKEY_Pos                   _UINT32_(8)                                          /* (HSMC_WPMR) Write Protection Key Position */
#define HSMC_WPMR_WPKEY_Msk                   (_UINT32_(0xFFFFFF) << HSMC_WPMR_WPKEY_Pos)          /* (HSMC_WPMR) Write Protection Key Mask */
#define HSMC_WPMR_WPKEY(value)                (HSMC_WPMR_WPKEY_Msk & (_UINT32_(value) << HSMC_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the HSMC_WPMR register */
#define   HSMC_WPMR_WPKEY_PASSWD_Val          _UINT32_(0x534D43)                                   /* (HSMC_WPMR) Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0.  */
#define HSMC_WPMR_WPKEY_PASSWD                (HSMC_WPMR_WPKEY_PASSWD_Val << HSMC_WPMR_WPKEY_Pos)  /* (HSMC_WPMR) Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0. Position  */
#define HSMC_WPMR_Msk                         _UINT32_(0xFFFFFF01)                                 /* (HSMC_WPMR) Register Mask  */


